rkalyan95/stm32_ll_drivers/stm32_ll_gpio/include/stm32l433_ll_gpio_cfg.h
#ifndef STM32L433_LL_GPIO_CFG_H
#define STM32L433_LL_GPIO_CFG_H

#include <stdint.h>
#include <stm32l433xx.h>

enum {
    GPIO_MODE_INPUT = 0x0,   // Input mode
    GPIO_MODE_OUTPUT = 0x1,  // Output mode
    GPIO_MODE_ALTERNATE = 0x2, // Alternate function mode
    GPIO_MODE_ANALOG = 0x3   // Analog mode
};

typedef struct
{
    uint32_t GPIOA_MODE0:2; // GPIO mode for pin 0
    uint32_t GPIOA_MODE1:2; // GPIO mode for pin 1   
    uint32_t GPIOA_MODE2:2; // GPIO mode for pin 2
    uint32_t GPIOA_MODE3:2; // GPIO mode for pin 3
    uint32_t GPIOA_MODE4:2; // GPIO mode for pin 4
    uint32_t GPIOA_MODE5:2; // GPIO mode for pin 5   
    uint32_t GPIOA_MODE6:2; // GPIO mode for pin 6
    uint32_t GPIOA_MODE7:2; // GPIO mode for pin 7
    uint32_t GPIOA_MODE8:2; // GPIO mode for pin 8
    uint32_t GPIOA_MODE9:2; // GPIO mode for pin 9
    uint32_t GPIOA_MODE10:2; // GPIO mode for pin 10
    uint32_t GPIOA_MODE11:2; // GPIO mode for pin 11
    uint32_t GPIOA_MODE12:2; // GPIO mode for pin 12
    uint32_t GPIOA_MODE13:2; // GPIO mode for pin 13
    uint32_t GPIOA_MODE14:2; // GPIO mode for pin 14
    uint32_t GPIOA_MODE15:2; // GPIO mode for pin 15
}GPIOA_MODER_B_t;

typedef union
{
    GPIOA_MODER_B_t B;
    uint32_t U;
}GPIOA_MODER_Reg_t;

extern volatile GPIOA_MODER_Reg_t GPIOA_MODER_Reg;

typedef struct
{
    uint32_t GPIOB_MODE0:2; // GPIO mode for pin 0
    uint32_t GPIOB_MODE1:2; // GPIO mode for pin 1   
    uint32_t GPIOB_MODE2:2; // GPIO mode for pin 2
    uint32_t GPIOB_MODE3:2; // GPIO mode for pin 3
    uint32_t GPIOB_MODE4:2; // GPIO mode for pin 4
    uint32_t GPIOB_MODE5:2; // GPIO mode for pin 5   
    uint32_t GPIOB_MODE6:2; // GPIO mode for pin 6
    uint32_t GPIOB_MODE7:2; // GPIO mode for pin 7
    uint32_t GPIOB_MODE8:2; // GPIO mode for pin 8
    uint32_t GPIOB_MODE9:2; // GPIO mode for pin 9
    uint32_t GPIOB_MODE10:2; // GPIO mode for pin 10
    uint32_t GPIOB_MODE11:2; // GPIO mode for pin 11
    uint32_t GPIOB_MODE12:2; // GPIO mode for pin 12
    uint32_t GPIOB_MODE13:2; // GPIO mode for pin 13
    uint32_t GPIOB_MODE14:2; // GPIO mode for pin 14
    uint32_t GPIOB_MODE15:2; // GPIO mode for pin 15 
}GPIOB_MODER_B_t;

typedef union
{
    GPIOB_MODER_B_t B;
    uint32_t U;
}GPIOB_MODER_Reg_t;


extern volatile GPIOB_MODER_Reg_t GPIOB_MODER_Reg;

typedef struct
{
    uint32_t GPIOC_MODE0:2; // GPIO mode for pin 0
    uint32_t GPIOC_MODE1:2; // GPIO mode for pin 1   
    uint32_t GPIOC_MODE2:2; // GPIO mode for pin 2
    uint32_t GPIOC_MODE3:2; // GPIO mode for pin 3
    uint32_t GPIOC_MODE4:2; // GPIO mode for pin 4
    uint32_t GPIOC_MODE5:2; // GPIO mode for pin 5   
    uint32_t GPIOC_MODE6:2; // GPIO mode for pin 6
    uint32_t GPIOC_MODE7:2; // GPIO mode for pin 7
    uint32_t GPIOC_MODE8:2; // GPIO mode for pin 8
    uint32_t GPIOC_MODE9:2; // GPIO mode for pin 9
    uint32_t GPIOC_MODE10:2; // GPIO mode for pin 10
    uint32_t GPIOC_MODE11:2; // GPIO mode for pin 11
    uint32_t GPIOC_MODE12:2; // GPIO mode for pin 12
    uint32_t GPIOC_MODE13:2; // GPIO mode for pin 13
    uint32_t GPIOC_MODE14:2; // GPIO mode for pin 14
    uint32_t GPIOC_MODE15:2; // GPIO mode for pin 15
}GPIOC_MODER_B_t;

typedef union
{
    GPIOC_MODER_B_t B;
    uint32_t U;
}GPIOC_MODER_Reg_t;

extern volatile GPIOC_MODER_Reg_t GPIOC_MODER_Reg;

typedef struct
{
    uint32_t GPIOD_MODE0:2; // GPIO mode for pin 0
    uint32_t GPIOD_MODE1:2; // GPIO mode for pin 1   
    uint32_t GPIOD_MODE2:2; // GPIO mode for pin 2
    uint32_t GPIOD_MODE3:2; // GPIO mode for pin 3
    uint32_t GPIOD_MODE4:2; // GPIO mode for pin 4
    uint32_t GPIOD_MODE5:2; // GPIO mode for pin 5   
    uint32_t GPIOD_MODE6:2; // GPIO mode for pin 6
    uint32_t GPIOD_MODE7:2; // GPIO mode for pin 7
    uint32_t GPIOD_MODE8:2; // GPIO mode for pin 8
    uint32_t GPIOD_MODE9:2; // GPIO mode for pin 9
    uint32_t GPIOD_MODE10:2; // GPIO mode for pin 10
    uint32_t GPIOD_MODE11:2; // GPIO mode for pin 11
    uint32_t GPIOD_MODE12:2; // GPIO mode for pin 12
    uint32_t GPIOD_MODE13:2; // GPIO mode for pin 13
    uint32_t GPIOD_MODE14:2; // GPIO mode for pin 14
    uint32_t GPIOD_MODE15:2; // GPIO mode for pin 15  
}GPIOD_MODER_B_t;

typedef union
{
    GPIOD_MODER_B_t B;
    uint32_t U;
}GPIOD_MODER_Reg_t;

extern volatile GPIOD_MODER_Reg_t GPIOD_MODER_Reg;

typedef struct
{
    uint32_t GPIOE_MODE0:2; // GPIO mode for pin 0
    uint32_t GPIOE_MODE1:2; // GPIO mode for pin 1   
    uint32_t GPIOE_MODE2:2; // GPIO mode for pin 2
    uint32_t GPIOE_MODE3:2; // GPIO mode for pin 3
    uint32_t GPIOE_MODE4:2; // GPIO mode for pin 4
    uint32_t GPIOE_MODE5:2; // GPIO mode for pin 5   
    uint32_t GPIOE_MODE6:2; // GPIO mode for pin 6
    uint32_t GPIOE_MODE7:2; // GPIO mode for pin 7
    uint32_t GPIOE_MODE8:2; // GPIO mode for pin 8
    uint32_t GPIOE_MODE9:2; // GPIO mode for pin 9
    uint32_t GPIOE_MODE10:2; // GPIO mode for pin 10
    uint32_t GPIOE_MODE11:2; // GPIO mode for pin 11
    uint32_t GPIOE_MODE12:2; // GPIO mode for pin 12
    uint32_t GPIOE_MODE13:2; // GPIO mode for pin 13
    uint32_t GPIOE_MODE14:2; // GPIO mode for pin 14
    uint32_t GPIOE_MODE15:2; // GPIO mode for pin 15    
}GPIOE_MODER_B_t;

typedef union
{
    GPIOE_MODER_B_t B;
    uint32_t U;
}GPIOE_MODER_Reg_t;

extern volatile GPIOE_MODER_Reg_t GPIOE_MODER_Reg;

typedef struct
{
    uint32_t GPIOH_MODE0:2; // GPIO mode for pin 0
    uint32_t GPIOH_MODE1:2; // GPIO mode for pin 1   
    uint32_t GPIOH_MODE2:2; // GPIO mode for pin 2
    uint32_t GPIOH_MODE3:2; // GPIO mode for pin 3
    uint32_t GPIOH_MODE4:2; // GPIO mode for pin 4
    uint32_t GPIOH_MODE5:2; // GPIO mode for pin 5   
    uint32_t GPIOH_MODE6:2; // GPIO mode for pin 6
    uint32_t GPIOH_MODE7:2; // GPIO mode for pin 7
    uint32_t GPIOH_MODE8:2; // GPIO mode for pin 8
    uint32_t GPIOH_MODE9:2; // GPIO mode for pin 9
    uint32_t GPIOH_MODE10:2; // GPIO mode for pin 10
    uint32_t GPIOH_MODE11:2; // GPIO mode for pin 11
    uint32_t GPIOH_MODE12:2; // GPIO mode for pin 12
    uint32_t GPIOH_MODE13:2; // GPIO mode for pin 13
    uint32_t GPIOH_MODE14:2; // GPIO mode for pin 14
    uint32_t GPIOH_MODE15:2; // GPIO mode for pin 15  
}GPIOH_MODER_B_t;

typedef union
{
    GPIOH_MODER_B_t B;
    uint32_t U;
}GPIOH_MODER_Reg_t;

