rkalyan95/stm32_ll_drivers/stm32_ll_gpio/include/stm32l433_ll_gpio_cfg.h
extern volatile GPIOH_MODER_Reg_t GPIOH_MODER_Reg;

enum {
    GPIO_OTYPE_PP = 0x0,   // Push-pull output type
    GPIO_OTYPE_OD = 0x1    // Open-drain output type
};

typedef struct
{
    uint32_t GPIOA_OTYPER0:1; // GPIO output type for pin 0
    uint32_t GPIOA_OTYPER1:1; // GPIO output type for pin 1
    uint32_t GPIOA_OTYPER2:1; // GPIO output type for pin 2
    uint32_t GPIOA_OTYPER3:1; // GPIO output type for pin 3
    uint32_t GPIOA_OTYPER4:1; // GPIO output type for pin   4
    uint32_t GPIOA_OTYPER5:1; // GPIO output type for pin 5
    uint32_t GPIOA_OTYPER6:1; // GPIO output type for pin   6
    uint32_t GPIOA_OTYPER7:1; // GPIO output type for pin 7
    uint32_t GPIOA_OTYPER8:1; // GPIO output type for pin 8 
    uint32_t GPIOA_OTYPER9:1; // GPIO output type for pin 9
    uint32_t GPIOA_OTYPER10:1; // GPIO output type for pin 10
    uint32_t GPIOA_OTYPER11:1; // GPIO output type for pin 11   
    uint32_t GPIOA_OTYPER12:1; // GPIO output type for pin 12
    uint32_t GPIOA_OTYPER13:1; // GPIO output type for pin 13
    uint32_t GPIOA_OTYPER14:1; // GPIO output type for pin 14
    uint32_t GPIOA_OTYPER15:1; // GPIO output type for pin 15
}GPIOA_OTYPER_B_t;

typedef union
{
    GPIOA_OTYPER_B_t B;
    uint32_t U;
}GPIOA_OTYPER_Reg_t;

extern volatile GPIOA_OTYPER_Reg_t GPIOA_OTYPER_Reg;

typedef struct
{
    uint32_t GPIOB_OTYPER0:1; // GPIO output type for pin 0
    uint32_t GPIOB_OTYPER1:1; // GPIO output type for pin 1
    uint32_t GPIOB_OTYPER2:1; // GPIO output type for pin 2
    uint32_t GPIOB_OTYPER3:1; // GPIO output type for pin 3
    uint32_t GPIOB_OTYPER4:1; // GPIO output type for pin   4
    uint32_t GPIOB_OTYPER5:1; // GPIO output type for pin 5
    uint32_t GPIOB_OTYPER6:1; // GPIO output type for pin   6
    uint32_t GPIOB_OTYPER7:1; // GPIO output type for pin 7
    uint32_t GPIOB_OTYPER8:1; // GPIO output type for pin 8 
    uint32_t GPIOB_OTYPER9:1; // GPIO output type for pin 9
    uint32_t GPIOB_OTYPER10:1; // GPIO output type for pin 10
    uint32_t GPIOB_OTYPER11:1; // GPIO output type for pin 11   
    uint32_t GPIOB_OTYPER12:1; // GPIO output type for pin 12
    uint32_t GPIOB_OTYPER13:1; // GPIO output type for pin 13
    uint32_t GPIOB_OTYPER14:1; // GPIO output type for pin 14
    uint32_t GPIOB_OTYPER15:1; // GPIO output type for pin 15
}GPIOB_OTYPER_B_t;

typedef union
{
    GPIOB_OTYPER_B_t B;
    uint32_t U;
}GPIOB_OTYPER_Reg_t;

extern volatile GPIOB_OTYPER_Reg_t GPIOB_OTYPER_Reg;

typedef struct
{
    uint32_t GPIOC_OTYPER0:1; // GPIO output type for pin 0
    uint32_t GPIOC_OTYPER1:1; // GPIO output type for pin 1
    uint32_t GPIOC_OTYPER2:1; // GPIO output type for pin 2
    uint32_t GPIOC_OTYPER3:1; // GPIO output type for pin 3
    uint32_t GPIOC_OTYPER4:1; // GPIO output type for pin   4
    uint32_t GPIOC_OTYPER5:1; // GPIO output type for pin 5
    uint32_t GPIOC_OTYPER6:1; // GPIO output type for pin   6
    uint32_t GPIOC_OTYPER7:1; // GPIO output type for pin 7
    uint32_t GPIOC_OTYPER8:1; // GPIO output type for pin 8 
    uint32_t GPIOC_OTYPER9:1; // GPIO output type for pin 9
    uint32_t GPIOC_OTYPER10:1; // GPIO output type for pin 10
    uint32_t GPIOC_OTYPER11:1; // GPIO output type for pin 11   
    uint32_t GPIOC_OTYPER12:1; // GPIO output type for pin 12
    uint32_t GPIOC_OTYPER13:1; // GPIO output type for pin 13
    uint32_t GPIOC_OTYPER14:1; // GPIO output type for pin 14
    uint32_t GPIOC_OTYPER15:1; // GPIO output type for pin 15   
}GPIOC_OTYPER_B_t;

typedef union
{
    GPIOC_OTYPER_B_t B;
    uint32_t U;
}GPIOC_OTYPER_Reg_t;

extern volatile GPIOC_OTYPER_Reg_t GPIOC_OTYPER_Reg;

typedef struct
{
    uint32_t GPIOD_OTYPER0:1; // GPIO output type for pin 0
    uint32_t GPIOD_OTYPER1:1; // GPIO output type for pin 1
    uint32_t GPIOD_OTYPER2:1; // GPIO output type for pin 2
    uint32_t GPIOD_OTYPER3:1; // GPIO output type for pin 3
    uint32_t GPIOD_OTYPER4:1; // GPIO output type for pin   4
    uint32_t GPIOD_OTYPER5:1; // GPIO output type for pin 5
    uint32_t GPIOD_OTYPER6:1; // GPIO output type for pin   6
    uint32_t GPIOD_OTYPER7:1; // GPIO output type for pin 7
    uint32_t GPIOD_OTYPER8:1; // GPIO output type for pin 8 
    uint32_t GPIOD_OTYPER9:1; // GPIO output type for pin 9
    uint32_t GPIOD_OTYPER10:1; // GPIO output type for pin 10
    uint32_t GPIOD_OTYPER11:1; // GPIO output type for pin 11   
    uint32_t GPIOD_OTYPER12:1; // GPIO output type for pin 12
    uint32_t GPIOD_OTYPER13:1; // GPIO output type for pin 13
    uint32_t GPIOD_OTYPER14:1; // GPIO output type for pin 14
    uint32_t GPIOD_OTYPER15:1; // GPIO output type for pin 15   
}GPIOD_OTYPER_B_t;

typedef union
{
    GPIOD_OTYPER_B_t B;
    uint32_t U;
}GPIOD_OTYPER_Reg_t;

extern volatile GPIOD_OTYPER_Reg_t GPIOD_OTYPER_Reg;

typedef struct
{
    uint32_t GPIOE_OTYPER0:1; // GPIO output type for pin 0
    uint32_t GPIOE_OTYPER1:1; // GPIO output type for pin 1
    uint32_t GPIOE_OTYPER2:1; // GPIO output type for pin 2
    uint32_t GPIOE_OTYPER3:1; // GPIO output type for pin 3
    uint32_t GPIOE_OTYPER4:1; // GPIO output type for pin   4
    uint32_t GPIOE_OTYPER5:1; // GPIO output type for pin 5
    uint32_t GPIOE_OTYPER6:1; // GPIO output type for pin   6
    uint32_t GPIOE_OTYPER7:1; // GPIO output type for pin 7
    uint32_t GPIOE_OTYPER8:1; // GPIO output type for pin 8 
    uint32_t GPIOE_OTYPER9:1; // GPIO output type for pin 9
    uint32_t GPIOE_OTYPER10:1; // GPIO output type for pin 10
    uint32_t GPIOE_OTYPER11:1; // GPIO output type for pin 11   
    uint32_t GPIOE_OTYPER12:1; // GPIO output type for pin 12
    uint32_t GPIOE_OTYPER13:1; // GPIO output type for pin 13
    uint32_t GPIOE_OTYPER14:1; // GPIO output type for pin 14
    uint32_t GPIOE_OTYPER15:1; // GPIO output type for pin 15   
}GPIOE_OTYPER_B_t;

typedef union
{
    GPIOE_OTYPER_B_t B;
    uint32_t U;
}GPIOE_OTYPER_Reg_t;

extern volatile GPIOE_OTYPER_Reg_t GPIOE_OTYPER_Reg;

typedef struct
{
    uint32_t GPIOH_OTYPER0:1; // GPIO output type for pin 0
    uint32_t GPIOH_OTYPER1:1; // GPIO output type for pin 1
    uint32_t GPIOH_OTYPER2:1; // GPIO output type for pin 2
    uint32_t GPIOH_OTYPER3:1; // GPIO output type for pin 3
    uint32_t GPIOH_OTYPER4:1; // GPIO output type for pin   4
    uint32_t GPIOH_OTYPER5:1; // GPIO output type for pin 5
    uint32_t GPIOH_OTYPER6:1; // GPIO output type for pin   6
    uint32_t GPIOH_OTYPER7:1; // GPIO output type for pin 7
    uint32_t GPIOH_OTYPER8:1; // GPIO output type for pin 8 
    uint32_t GPIOH_OTYPER9:1; // GPIO output type for pin 9
    uint32_t GPIOH_OTYPER10:1; // GPIO output type for pin 10
    uint32_t GPIOH_OTYPER11:1; // GPIO output type for pin 11   
    uint32_t GPIOH_OTYPER12:1; // GPIO output type for pin 12
    uint32_t GPIOH_OTYPER13:1; // GPIO output type for pin 13
    uint32_t GPIOH_OTYPER14:1; // GPIO output type for pin 14
    uint32_t GPIOH_OTYPER15:1; // GPIO output type for pin 15
}GPIOH_OTYPER_B_t;

typedef union
{
    GPIOH_OTYPER_B_t B;
    uint32_t U;
}GPIOH_OTYPER_Reg_t;

extern volatile GPIOH_OTYPER_Reg_t GPIOH_OTYPER_Reg;

enum {
    GPIO_SPEED_LOW = 0x0,    // Low speed
    GPIO_SPEED_MEDIUM = 0x1, // Medium speed
    GPIO_SPEED_HIGH = 0x2,   // High speed
    GPIO_SPEED_VERY_HIGH = 0x3 // Very high speed
};

typedef struct
{
    uint32_t GPIOA_OSPEEDR0:2; // GPIO speed for pin 0
    uint32_t GPIOA_OSPEEDR1:2; // GPIO speed for pin 1
    uint32_t GPIOA_OSPEEDR2:2; // GPIO speed for pin 2
    uint32_t GPIOA_OSPEEDR3:2; // GPIO speed for pin 3
    uint32_t GPIOA_OSPEEDR4:2; // GPIO speed for pin 4
    uint32_t GPIOA_OSPEEDR5:2; // GPIO speed for pin 5
    uint32_t GPIOA_OSPEEDR6:2; // GPIO speed for pin 6
    uint32_t GPIOA_OSPEEDR7:2; // GPIO speed for pin 7
    uint32_t GPIOA_OSPEEDR8:2; // GPIO speed for pin 8
    uint32_t GPIOA_OSPEEDR9:2; // GPIO speed for pin 9
    uint32_t GPIOA_OSPEEDR10:2; // GPIO speed for pin 10
    uint32_t GPIOA_OSPEEDR11:2; // GPIO speed for pin 11
    uint32_t GPIOA_OSPEEDR12:2; // GPIO speed for pin 12
    uint32_t GPIOA_OSPEEDR13:2; // GPIO speed for pin 13
    uint32_t GPIOA_OSPEEDR14:2; // GPIO speed for pin 14
    uint32_t GPIOA_OSPEEDR15:2; // GPIO speed for pin 15
}GPIOA_OSPEEDR_B_t;

typedef union
{
    GPIOA_OSPEEDR_B_t B;
    uint32_t U;
}GPIOA_OSPEEDR_Reg_t;

extern volatile GPIOA_OSPEEDR_Reg_t GPIOA_OSPEEDR_Reg;

typedef struct
{
    uint32_t GPIOB_OSPEEDR0:2; // GPIO speed for pin 0
    uint32_t GPIOB_OSPEEDR1:2; // GPIO speed for pin 1
    uint32_t GPIOB_OSPEEDR2:2; // GPIO speed for pin 2
    uint32_t GPIOB_OSPEEDR3:2; // GPIO speed for pin 3
    uint32_t GPIOB_OSPEEDR4:2; // GPIO speed for pin 4
    uint32_t GPIOB_OSPEEDR5:2; // GPIO speed for pin 5
    uint32_t GPIOB_OSPEEDR6:2; // GPIO speed for pin 6
    uint32_t GPIOB_OSPEEDR7:2; // GPIO speed for pin 7
    uint32_t GPIOB_OSPEEDR8:2; // GPIO speed for pin 8
    uint32_t GPIOB_OSPEEDR9:2; // GPIO speed for pin 9
    uint32_t GPIOB_OSPEEDR10:2; // GPIO speed for pin 10
    uint32_t GPIOB_OSPEEDR11:2; // GPIO speed for pin 11
    uint32_t GPIOB_OSPEEDR12:2; // GPIO speed for pin 12
    uint32_t GPIOB_OSPEEDR13:2; // GPIO speed for pin 13
    uint32_t GPIOB_OSPEEDR14:2; // GPIO speed for pin 14
    uint32_t GPIOB_OSPEEDR15:2; // GPIO speed for pin 15
}GPIOB_OSPEEDR_B_t;

typedef union
{
    GPIOB_OSPEEDR_B_t B;
    uint32_t U;
}GPIOB_OSPEEDR_Reg_t;

extern volatile GPIOB_OSPEEDR_Reg_t GPIOB_OSPEEDR_Reg;

typedef struct
{
    uint32_t GPIOC_OSPEEDR0:2; // GPIO speed for pin 0
    uint32_t GPIOC_OSPEEDR1:2; // GPIO speed for pin 1
    uint32_t GPIOC_OSPEEDR2:2; // GPIO speed for pin 2
    uint32_t GPIOC_OSPEEDR3:2; // GPIO speed for pin 3
    uint32_t GPIOC_OSPEEDR4:2; // GPIO speed for pin 4
    uint32_t GPIOC_OSPEEDR5:2; // GPIO speed for pin 5
    uint32_t GPIOC_OSPEEDR6:2; // GPIO speed for pin 6
    uint32_t GPIOC_OSPEEDR7:2; // GPIO speed for pin 7
    uint32_t GPIOC_OSPEEDR8:2; // GPIO speed for pin 8
    uint32_t GPIOC_OSPEEDR9:2; // GPIO speed for pin 9
    uint32_t GPIOC_OSPEEDR10:2; // GPIO speed for pin 10
    uint32_t GPIOC_OSPEEDR11:2; // GPIO speed for pin 11
    uint32_t GPIOC_OSPEEDR12:2; // GPIO speed for pin 12
    uint32_t GPIOC_OSPEEDR13:2; // GPIO speed for pin 13
    uint32_t GPIOC_OSPEEDR14:2; // GPIO speed for pin 14
    uint32_t GPIOC_OSPEEDR15:2; // GPIO speed for pin 15    
}GPIOC_OSPEEDR_B_t;

typedef union
{
    GPIOC_OSPEEDR_B_t B;
    uint32_t U;
}GPIOC_OSPEEDR_Reg_t;

extern volatile GPIOC_OSPEEDR_Reg_t GPIOC_OSPEEDR_Reg;

typedef struct
{
    uint32_t GPIOD_OSPEEDR0:2; // GPIO speed for pin 0
    uint32_t GPIOD_OSPEEDR1:2; // GPIO speed for pin 1
    uint32_t GPIOD_OSPEEDR2:2; // GPIO speed for pin 2
    uint32_t GPIOD_OSPEEDR3:2; // GPIO speed for pin 3
    uint32_t GPIOD_OSPEEDR4:2; // GPIO speed for pin 4
    uint32_t GPIOD_OSPEEDR5:2; // GPIO speed for pin 5
    uint32_t GPIOD_OSPEEDR6:2; // GPIO speed for pin 6
    uint32_t GPIOD_OSPEEDR7:2; // GPIO speed for pin 7
    uint32_t GPIOD_OSPEEDR8:2; // GPIO speed for pin 8
    uint32_t GPIOD_OSPEEDR9:2; // GPIO speed for pin 9
    uint32_t GPIOD_OSPEEDR10:2; // GPIO speed for pin 10
    uint32_t GPIOD_OSPEEDR11:2; // GPIO speed for pin 11
    uint32_t GPIOD_OSPEEDR12:2; // GPIO speed for pin 12
    uint32_t GPIOD_OSPEEDR13:2; // GPIO speed for pin 13
    uint32_t GPIOD_OSPEEDR14:2; // GPIO speed for pin 14
    uint32_t GPIOD_OSPEEDR15:2; // GPIO speed for pin 15   
}GPIOD_OSPEEDR_B_t;

typedef union
{
    GPIOD_OSPEEDR_B_t B;
    uint32_t U;
}GPIOD_OSPEEDR_Reg_t;

