rkalyan95/stm32_ll_drivers/stm32_ll_gpio/include/stm32l433_ll_gpio_cfg.h
extern volatile GPIOD_OSPEEDR_Reg_t GPIOD_OSPEEDR_Reg;

typedef struct
{
    uint32_t GPIOE_OSPEEDR0:2; // GPIO speed for pin 0
    uint32_t GPIOE_OSPEEDR1:2; // GPIO speed for pin 1
    uint32_t GPIOE_OSPEEDR2:2; // GPIO speed for pin 2
    uint32_t GPIOE_OSPEEDR3:2; // GPIO speed for pin 3
    uint32_t GPIOE_OSPEEDR4:2; // GPIO speed for pin 4
    uint32_t GPIOE_OSPEEDR5:2; // GPIO speed for pin 5
    uint32_t GPIOE_OSPEEDR6:2; // GPIO speed for pin 6
    uint32_t GPIOE_OSPEEDR7:2; // GPIO speed for pin 7
    uint32_t GPIOE_OSPEEDR8:2; // GPIO speed for pin 8
    uint32_t GPIOE_OSPEEDR9:2; // GPIO speed for pin 9
    uint32_t GPIOE_OSPEEDR10:2; // GPIO speed for pin 10
    uint32_t GPIOE_OSPEEDR11:2; // GPIO speed for pin 11
    uint32_t GPIOE_OSPEEDR12:2; // GPIO speed for pin 12
    uint32_t GPIOE_OSPEEDR13:2; // GPIO speed for pin 13
    uint32_t GPIOE_OSPEEDR14:2; // GPIO speed for pin 14
    uint32_t GPIOE_OSPEEDR15:2; // GPIO speed for pin 15
}GPIOE_OSPEEDR_B_t;

typedef union
{
    GPIOE_OSPEEDR_B_t B;
    uint32_t U;
}GPIOE_OSPEEDR_Reg_t;

extern volatile GPIOE_OSPEEDR_Reg_t GPIOE_OSPEEDR_Reg;

typedef struct
{
    uint32_t GPIOH_OSPEEDR0:2; // GPIO speed for pin 0
    uint32_t GPIOH_OSPEEDR1:2; // GPIO speed for pin 1
    uint32_t GPIOH_OSPEEDR2:2; // GPIO speed for pin 2
    uint32_t GPIOH_OSPEEDR3:2; // GPIO speed for pin 3
    uint32_t GPIOH_OSPEEDR4:2; // GPIO speed for pin 4
    uint32_t GPIOH_OSPEEDR5:2; // GPIO speed for pin 5
    uint32_t GPIOH_OSPEEDR6:2; // GPIO speed for pin 6
    uint32_t GPIOH_OSPEEDR7:2; // GPIO speed for pin 7
    uint32_t GPIOH_OSPEEDR8:2; // GPIO speed for pin 8
    uint32_t GPIOH_OSPEEDR9:2; // GPIO speed for pin 9
    uint32_t GPIOH_OSPEEDR10:2; // GPIO speed for pin 10
    uint32_t GPIOH_OSPEEDR11:2; // GPIO speed for pin 11
    uint32_t GPIOH_OSPEEDR12:2; // GPIO speed for pin 12
    uint32_t GPIOH_OSPEEDR13:2; // GPIO speed for pin 13
    uint32_t GPIOH_OSPEEDR14:2; // GPIO speed for pin 14
    uint32_t GPIOH_OSPEEDR15:2; // GPIO speed for pin 15
}GPIOH_OSPEEDR_B_t;

typedef union
{
    GPIOH_OSPEEDR_B_t B;
    uint32_t U;
}GPIOH_OSPEEDR_Reg_t;

extern volatile GPIOH_OSPEEDR_Reg_t GPIOH_OSPEEDR_Reg;

enum {
    GPIO_PUPD_NONE = 0x0,   // No pull-up or pull-down
    GPIO_PUPD_PULL_UP = 0x1, // Pull-up
    GPIO_PUPD_PULL_DOWN = 0x2 // Pull-down
};

typedef struct
{
    uint32_t GPIOA_PUPDR0:2; // GPIO pull-up/pull-down for pin 0
    uint32_t GPIOA_PUPDR1:2; // GPIO pull-up/pull-down for pin 1
    uint32_t GPIOA_PUPDR2:2; // GPIO pull-up/pull-down for pin 2
    uint32_t GPIOA_PUPDR3:2; // GPIO pull-up/pull-down for pin 3
    uint32_t GPIOA_PUPDR4:2; // GPIO pull-up/pull-down for pin 4
    uint32_t GPIOA_PUPDR5:2; // GPIO pull-up/pull-down for pin 5
    uint32_t GPIOA_PUPDR6:2; // GPIO pull-up/pull-down for pin 6
    uint32_t GPIOA_PUPDR7:2; // GPIO pull-up/pull-down for pin 7
    uint32_t GPIOA_PUPDR8:2; // GPIO pull-up/pull-down for pin 8
    uint32_t GPIOA_PUPDR9:2; // GPIO pull-up/pull-down for pin 9
    uint32_t GPIOA_PUPDR10:2; // GPIO pull-up/pull-down for pin 10
    uint32_t GPIOA_PUPDR11:2; // GPIO pull-up/pull-down for pin 11
    uint32_t GPIOA_PUPDR12:2; // GPIO pull-up/pull-down for pin 12
    uint32_t GPIOA_PUPDR13:2; // GPIO pull-up/pull-down for pin 13
    uint32_t GPIOA_PUPDR14:2; // GPIO pull-up/pull-down for pin 14
    uint32_t GPIOA_PUPDR15:2; // GPIO pull-up/pull-down for pin 15
}GPIOA_PUPDR_B_t;

typedef union
{
    GPIOA_PUPDR_B_t B;
    uint32_t U;
}GPIOA_PUPDR_Reg_t;

extern volatile GPIOA_PUPDR_Reg_t GPIOA_PUPDR_Reg;

typedef struct
{
    uint32_t GPIOB_PUPDR0:2; // GPIO pull-up/pull-down for pin 0
    uint32_t GPIOB_PUPDR1:2; // GPIO pull-up/pull-down for pin 1
    uint32_t GPIOB_PUPDR2:2; // GPIO pull-up/pull-down for pin 2
    uint32_t GPIOB_PUPDR3:2; // GPIO pull-up/pull-down for pin 3
    uint32_t GPIOB_PUPDR4:2; // GPIO pull-up/pull-down for pin 4
    uint32_t GPIOB_PUPDR5:2; // GPIO pull-up/pull-down for pin 5
    uint32_t GPIOB_PUPDR6:2; // GPIO pull-up/pull-down for pin 6
    uint32_t GPIOB_PUPDR7:2; // GPIO pull-up/pull-down for pin 7
    uint32_t GPIOB_PUPDR8:2; // GPIO pull-up/pull-down for pin 8
    uint32_t GPIOB_PUPDR9:2; // GPIO pull-up/pull-down for pin 9
    uint32_t GPIOB_PUPDR10:2; // GPIO pull-up/pull-down for pin 10
    uint32_t GPIOB_PUPDR11:2; // GPIO pull-up/pull-down for pin 11
    uint32_t GPIOB_PUPDR12:2; // GPIO pull-up/pull-down for pin 12
    uint32_t GPIOB_PUPDR13:2; // GPIO pull-up/pull-down for pin 13
    uint32_t GPIOB_PUPDR14:2; // GPIO pull-up/pull-down for pin 14
    uint32_t GPIOB_PUPDR15:2; // GPIO pull-up/pull-down for pin 15
}GPIOB_PUPDR_B_t;

typedef union
{
    GPIOB_PUPDR_B_t B;
    uint32_t U;
}GPIOB_PUPDR_Reg_t;

extern volatile GPIOB_PUPDR_Reg_t GPIOB_PUPDR_Reg;

typedef struct
{
    uint32_t GPIOC_PUPDR0:2; // GPIO pull-up/pull-down for pin 0
    uint32_t GPIOC_PUPDR1:2; // GPIO pull-up/pull-down for pin 1
    uint32_t GPIOC_PUPDR2:2; // GPIO pull-up/pull-down for pin 2
    uint32_t GPIOC_PUPDR3:2; // GPIO pull-up/pull-down for pin 3
    uint32_t GPIOC_PUPDR4:2; // GPIO pull-up/pull-down for pin 4
    uint32_t GPIOC_PUPDR5:2; // GPIO pull-up/pull-down for pin 5
    uint32_t GPIOC_PUPDR6:2; // GPIO pull-up/pull-down for pin 6
    uint32_t GPIOC_PUPDR7:2; // GPIO pull-up/pull-down for pin 7
    uint32_t GPIOC_PUPDR8:2; // GPIO pull-up/pull-down for pin 8
    uint32_t GPIOC_PUPDR9:2; // GPIO pull-up/pull-down for pin 9
    uint32_t GPIOC_PUPDR10:2; // GPIO pull-up/pull-down for pin 10
    uint32_t GPIOC_PUPDR11:2; // GPIO pull-up/pull-down for pin 11
    uint32_t GPIOC_PUPDR12:2; // GPIO pull-up/pull-down for pin 12
    uint32_t GPIOC_PUPDR13:2; // GPIO pull-up/pull-down for pin 13
    uint32_t GPIOC_PUPDR14:2; // GPIO pull-up/pull-down for pin 14
    uint32_t GPIOC_PUPDR15:2; // GPIO pull-up/pull-down for pin 15
}GPIOC_PUPDR_B_t;

typedef union
{
    GPIOC_PUPDR_B_t B;
    uint32_t U;
}GPIOC_PUPDR_Reg_t;

extern volatile GPIOC_PUPDR_Reg_t GPIOC_PUPDR_Reg;

typedef struct
{
    uint32_t GPIOD_PUPDR0:2; // GPIO pull-up/pull-down for pin 0
    uint32_t GPIOD_PUPDR1:2; // GPIO pull-up/pull-down for pin 1
    uint32_t GPIOD_PUPDR2:2; // GPIO pull-up/pull-down for pin 2
    uint32_t GPIOD_PUPDR3:2; // GPIO pull-up/pull-down for pin 3
    uint32_t GPIOD_PUPDR4:2; // GPIO pull-up/pull-down for pin 4
    uint32_t GPIOD_PUPDR5:2; // GPIO pull-up/pull-down for pin 5
    uint32_t GPIOD_PUPDR6:2; // GPIO pull-up/pull-down for pin 6
    uint32_t GPIOD_PUPDR7:2; // GPIO pull-up/pull-down for pin 7
    uint32_t GPIOD_PUPDR8:2; // GPIO pull-up/pull-down for pin 8
    uint32_t GPIOD_PUPDR9:2; // GPIO pull-up/pull-down for pin 9
    uint32_t GPIOD_PUPDR10:2; // GPIO pull-up/pull-down for pin 10
    uint32_t GPIOD_PUPDR11:2; // GPIO pull-up/pull-down for pin 11
    uint32_t GPIOD_PUPDR12:2; // GPIO pull-up/pull-down for pin 12
    uint32_t GPIOD_PUPDR13:2; // GPIO pull-up/pull-down for pin 13
    uint32_t GPIOD_PUPDR14:2; // GPIO pull-up/pull-down for pin 14
    uint32_t GPIOD_PUPDR15:2; // GPIO pull-up/pull-down for pin 15
}GPIOD_PUPDR_B_t;

typedef union
{
    GPIOD_PUPDR_B_t B;
    uint32_t U;
}GPIOD_PUPDR_Reg_t;

extern volatile GPIOD_PUPDR_Reg_t GPIOD_PUPDR_Reg;

typedef struct
{
    uint32_t GPIOE_PUPDR0:2; // GPIO pull-up/pull-down for pin 0
    uint32_t GPIOE_PUPDR1:2; // GPIO pull-up/pull-down for pin 1
    uint32_t GPIOE_PUPDR2:2; // GPIO pull-up/pull-down for pin 2
    uint32_t GPIOE_PUPDR3:2; // GPIO pull-up/pull-down for pin 3
    uint32_t GPIOE_PUPDR4:2; // GPIO pull-up/pull-down for pin 4
    uint32_t GPIOE_PUPDR5:2; // GPIO pull-up/pull-down for pin 5
    uint32_t GPIOE_PUPDR6:2; // GPIO pull-up/pull-down for pin 6
    uint32_t GPIOE_PUPDR7:2; // GPIO pull-up/pull-down for pin 7
    uint32_t GPIOE_PUPDR8:2; // GPIO pull-up/pull-down for pin 8
    uint32_t GPIOE_PUPDR9:2; // GPIO pull-up/pull-down for pin 9
    uint32_t GPIOE_PUPDR10:2; // GPIO pull-up/pull-down for pin 10
    uint32_t GPIOE_PUPDR11:2; // GPIO pull-up/pull-down for pin 11
    uint32_t GPIOE_PUPDR12:2; // GPIO pull-up/pull-down for pin 12
    uint32_t GPIOE_PUPDR13:2; // GPIO pull-up/pull-down for pin 13
    uint32_t GPIOE_PUPDR14:2; // GPIO pull-up/pull-down for pin 14
    uint32_t GPIOE_PUPDR15:2; // GPIO pull-up/pull-down for pin 15
}GPIOE_PUPDR_B_t;

typedef union
{
    GPIOE_PUPDR_B_t B;
    uint32_t U;
}GPIOE_PUPDR_Reg_t;

extern volatile GPIOE_PUPDR_Reg_t GPIOE_PUPDR_Reg;

typedef struct
{
    uint32_t GPIOH_PUPDR0:2; // GPIO pull-up/pull-down for pin 0
    uint32_t GPIOH_PUPDR1:2; // GPIO pull-up/pull-down for pin 1
    uint32_t GPIOH_PUPDR2:2; // GPIO pull-up/pull-down for pin 2
    uint32_t GPIOH_PUPDR3:2; // GPIO pull-up/pull-down for pin 3
    uint32_t GPIOH_PUPDR4:2; // GPIO pull-up/pull-down for pin 4
    uint32_t GPIOH_PUPDR5:2; // GPIO pull-up/pull-down for pin 5
    uint32_t GPIOH_PUPDR6:2; // GPIO pull-up/pull-down for pin 6
    uint32_t GPIOH_PUPDR7:2; // GPIO pull-up/pull-down for pin 7
    uint32_t GPIOH_PUPDR8:2; // GPIO pull-up/pull-down for pin 8
    uint32_t GPIOH_PUPDR9:2; // GPIO pull-up/pull-down for pin 9
    uint32_t GPIOH_PUPDR10:2; // GPIO pull-up/pull-down for pin 10
    uint32_t GPIOH_PUPDR11:2; // GPIO pull-up/pull-down for pin 11
    uint32_t GPIOH_PUPDR12:2; // GPIO pull-up/pull-down for pin 12
    uint32_t GPIOH_PUPDR13:2; // GPIO pull-up/pull-down for pin 13
    uint32_t GPIOH_PUPDR14:2; // GPIO pull-up/pull-down for pin 14
    uint32_t GPIOH_PUPDR15:2; // GPIO pull-up/pull-down for pin 15
}GPIOH_PUPDR_B_t;

typedef union
{
    GPIOH_PUPDR_B_t B;
    uint32_t U;
}GPIOH_PUPDR_Reg_t;

extern volatile GPIOH_PUPDR_Reg_t GPIOH_PUPDR_Reg;

typedef struct
{
    uint32_t GPIOA_ID0:1; // GPIOA pin 0 input data
    uint32_t GPIOA_ID1:1; // GPIOA pin 1 input data
    uint32_t GPIOA_ID2:1; // GPIOA pin 2 input data
    uint32_t GPIOA_ID3:1; // GPIOA pin 3 input data
    uint32_t GPIOA_ID4:1; // GPIOA pin 4 input data
    uint32_t GPIOA_ID5:1; // GPIOA pin 5 input data
    uint32_t GPIOA_ID6:1; // GPIOA pin 6 input data
    uint32_t GPIOA_ID7:1; // GPIOA pin 7 input data
    uint32_t GPIOA_ID8:1; // GPIOA pin 8 input data
    uint32_t GPIOA_ID9:1; // GPIOA pin 9 input data
    uint32_t GPIOA_ID10:1; // GPIOA pin 10 input data
    uint32_t GPIOA_ID11:1; // GPIOA pin 11 input data
    uint32_t GPIOA_ID12:1; // GPIOA pin 12 input data
    uint32_t GPIOA_ID13:1; // GPIOA pin 13 input data
    uint32_t GPIOA_ID14:1; // GPIOA pin 14 input data
    uint32_t GPIOA_ID15:1; // GPIOA pin 15 input data
}GPIOA_IDR_B_t;

typedef union
{
    GPIOA_IDR_B_t B;
    uint32_t U;
}GPIOA_IDR_Reg_t;

extern volatile GPIOA_IDR_Reg_t GPIOA_IDR_Reg;

typedef struct
{
    uint32_t GPIOB_ID0:1; // GPIOB pin 0 input data
    uint32_t GPIOB_ID1:1; // GPIOB pin 1 input data
    uint32_t GPIOB_ID2:1; // GPIOB pin 2 input data
    uint32_t GPIOB_ID3:1; // GPIOB pin 3 input data
    uint32_t GPIOB_ID4:1; // GPIOB pin 4 input data
    uint32_t GPIOB_ID5:1; // GPIOB pin 5 input data
    uint32_t GPIOB_ID6:1; // GPIOB pin 6 input data
    uint32_t GPIOB_ID7:1; // GPIOB pin 7 input data
    uint32_t GPIOB_ID8:1; // GPIOB pin 8 input data
    uint32_t GPIOB_ID9:1; // GPIOB pin 9 input data
    uint32_t GPIOB_ID10:1; // GPIOB pin 10 input data
    uint32_t GPIOB_ID11:1; // GPIOB pin 11 input data
    uint32_t GPIOB_ID12:1; // GPIOB pin 12 input data
    uint32_t GPIOB_ID13:1; // GPIOB pin 13 input data
    uint32_t GPIOB_ID14:1; // GPIOB pin 14 input data
    uint32_t GPIOB_ID15:1; // GPIOB pin 15 input data
}GPIOB_IDR_B_t;

typedef union
{
    GPIOB_IDR_B_t B;
    uint32_t U;
}GPIOB_IDR_Reg_t;

extern volatile GPIOB_IDR_Reg_t GPIOB_IDR_Reg;

typedef struct
{
    uint32_t GPIOC_ID0:1; // GPIOC pin 0 input data
    uint32_t GPIOC_ID1:1; // GPIOC pin 1 input data
    uint32_t GPIOC_ID2:1; // GPIOC pin 2 input data
    uint32_t GPIOC_ID3:1; // GPIOC pin 3 input data
    uint32_t GPIOC_ID4:1; // GPIOC pin 4 input data
    uint32_t GPIOC_ID5:1; // GPIOC pin 5 input data
    uint32_t GPIOC_ID6:1; // GPIOC pin 6 input data
    uint32_t GPIOC_ID7:1; // GPIOC pin 7 input data
    uint32_t GPIOC_ID8:1; // GPIOC pin 8 input data
    uint32_t GPIOC_ID9:1; // GPIOC pin 9 input data
    uint32_t GPIOC_ID10:1; // GPIOC pin 10 input data
    uint32_t GPIOC_ID11:1; // GPIOC pin 11 input data
    uint32_t GPIOC_ID12:1; // GPIOC pin 12 input data
    uint32_t GPIOC_ID13:1; // GPIOC pin 13 input data
    uint32_t GPIOC_ID14:1; // GPIOC pin 14 input data
    uint32_t GPIOC_ID15:1; // GPIOC pin 15 input data
}GPIOC_IDR_B_t;

typedef union
{
    GPIOC_IDR_B_t B;
    uint32_t U;
}GPIOC_IDR_Reg_t;

