rkalyan95/stm32_ll_drivers/stm32_ll_gpio/include/stm32l433_ll_gpio_cfg.h
extern volatile GPIOC_IDR_Reg_t GPIOC_IDR_Reg;

typedef struct
{
    uint32_t GPIOD_ID0:1; // GPIOD pin 0 input data
    uint32_t GPIOD_ID1:1; // GPIOD pin 1 input data
    uint32_t GPIOD_ID2:1; // GPIOD pin 2 input data
    uint32_t GPIOD_ID3:1; // GPIOD pin 3 input data
    uint32_t GPIOD_ID4:1; // GPIOD pin 4 input data
    uint32_t GPIOD_ID5:1; // GPIOD pin 5 input data
    uint32_t GPIOD_ID6:1; // GPIOD pin 6 input data
    uint32_t GPIOD_ID7:1; // GPIOD pin 7 input data
    uint32_t GPIOD_ID8:1; // GPIOD pin 8 input data
    uint32_t GPIOD_ID9:1; // GPIOD pin 9 input data
    uint32_t GPIOD_ID10:1; // GPIOD pin 10 input data
    uint32_t GPIOD_ID11:1; // GPIOD pin 11 input data
    uint32_t GPIOD_ID12:1; // GPIOD pin 12 input data
    uint32_t GPIOD_ID13:1; // GPIOD pin 13 input data
    uint32_t GPIOD_ID14:1; // GPIOD pin 14 input data
    uint32_t GPIOD_ID15:1; // GPIOD pin 15 input data
}GPIOD_IDR_B_t;

typedef union
{
    GPIOD_IDR_B_t B;
    uint32_t U;
}GPIOD_IDR_Reg_t;

extern volatile GPIOD_IDR_Reg_t GPIOD_IDR_Reg;

typedef struct
{
    uint32_t GPIOE_ID0:1; // GPIOE pin 0 input data
    uint32_t GPIOE_ID1:1; // GPIOE pin 1 input data
    uint32_t GPIOE_ID2:1; // GPIOE pin 2 input data
    uint32_t GPIOE_ID3:1; // GPIOE pin 3 input data
    uint32_t GPIOE_ID4:1; // GPIOE pin 4 input data
    uint32_t GPIOE_ID5:1; // GPIOE pin 5 input data
    uint32_t GPIOE_ID6:1; // GPIOE pin 6 input data
    uint32_t GPIOE_ID7:1; // GPIOE pin 7 input data
    uint32_t GPIOE_ID8:1; // GPIOE pin 8 input data
    uint32_t GPIOE_ID9:1; // GPIOE pin 9 input data
    uint32_t GPIOE_ID10:1; // GPIOE pin 10 input data
    uint32_t GPIOE_ID11:1; // GPIOE pin 11 input data
    uint32_t GPIOE_ID12:1; // GPIOE pin 12 input data
    uint32_t GPIOE_ID13:1; // GPIOE pin 13 input data
    uint32_t GPIOE_ID14:1; // GPIOE pin 14 input data
    uint32_t GPIOE_ID15:1; // GPIOE pin 15 input data
}GPIOE_IDR_B_t;

typedef union
{
    GPIOE_IDR_B_t B;
    uint32_t U;
}GPIOE_IDR_Reg_t;

extern volatile GPIOE_IDR_Reg_t GPIOE_IDR_Reg;

typedef struct
{
    uint32_t GPIOH_ID0:1; // GPIOH pin 0 input data
    uint32_t GPIOH_ID1:1; // GPIOH pin 1 input data
    uint32_t GPIOH_ID2:1; // GPIOH pin 2 input data
    uint32_t GPIOH_ID3:1; // GPIOH pin 3 input data
    uint32_t GPIOH_ID4:1; // GPIOH pin 4 input data
    uint32_t GPIOH_ID5:1; // GPIOH pin 5 input data
    uint32_t GPIOH_ID6:1; // GPIOH pin 6 input data
    uint32_t GPIOH_ID7:1; // GPIOH pin 7 input data
    uint32_t GPIOH_ID8:1; // GPIOH pin 8 input data
    uint32_t GPIOH_ID9:1; // GPIOH pin 9 input data
    uint32_t GPIOH_ID10:1; // GPIOH pin 10 input data
    uint32_t GPIOH_ID11:1; // GPIOH pin 11 input data
    uint32_t GPIOH_ID12:1; // GPIOH pin 12 input data
    uint32_t GPIOH_ID13:1; // GPIOH pin 13 input data
    uint32_t GPIOH_ID14:1; // GPIOH pin 14 input data
    uint32_t GPIOH_ID15:1; // GPIOH pin 15 input data
}GPIOH_IDR_B_t;

typedef union
{
    GPIOH_IDR_B_t B;
    uint32_t U;
}GPIOH_IDR_Reg_t;

extern volatile GPIOH_IDR_Reg_t GPIOH_IDR_Reg;

enum {
    GPIOA_ODR_LOW = 0x0, // Output data low
    GPIOA_ODR_HIGH = 0x1 // Output data high
};

typedef struct
{
    uint32_t GPIOA_ODR0:1; // GPIOA pin 0 output data
    uint32_t GPIOA_ODR1:1; // GPIOA pin 1 output data
    uint32_t GPIOA_ODR2:1; // GPIOA pin 2 output data
    uint32_t GPIOA_ODR3:1; // GPIOA pin 3 output data
    uint32_t GPIOA_ODR4:1; // GPIOA pin 4 output data
    uint32_t GPIOA_ODR5:1; // GPIOA pin 5 output data
    uint32_t GPIOA_ODR6:1; // GPIOA pin 6 output data
    uint32_t GPIOA_ODR7:1; // GPIOA pin 7 output data
    uint32_t GPIOA_ODR8:1; // GPIOA pin 8 output data
    uint32_t GPIOA_ODR9:1; // GPIOA pin 9 output data
    uint32_t GPIOA_ODR10:1; // GPIOA pin 10 output data
    uint32_t GPIOA_ODR11:1; // GPIOA pin 11 output data
    uint32_t GPIOA_ODR12:1; // GPIOA pin 12 output data
    uint32_t GPIOA_ODR13:1; // GPIOA pin 13 output data
    uint32_t GPIOA_ODR14:1; // GPIOA pin 14 output data
    uint32_t GPIOA_ODR15:1; // GPIOA pin 15 output data
}GPIOA_ODR_B_t;

typedef union
{
    GPIOA_ODR_B_t B;
    uint32_t U;
}GPIOA_ODR_Reg_t;

extern volatile GPIOA_ODR_Reg_t GPIOA_ODR_Reg;

typedef struct
{
    uint32_t GPIOB_ODR0:1; // GPIOB pin 0 output data
    uint32_t GPIOB_ODR1:1; // GPIOB pin 1 output data
    uint32_t GPIOB_ODR2:1; // GPIOB pin 2 output data
    uint32_t GPIOB_ODR3:1; // GPIOB pin 3 output data
    uint32_t GPIOB_ODR4:1; // GPIOB pin 4 output data
    uint32_t GPIOB_ODR5:1; // GPIOB pin 5 output data
    uint32_t GPIOB_ODR6:1; // GPIOB pin 6 output data
    uint32_t GPIOB_ODR7:1; // GPIOB pin 7 output data
    uint32_t GPIOB_ODR8:1; // GPIOB pin 8 output data
    uint32_t GPIOB_ODR9:1; // GPIOB pin 9 output data
    uint32_t GPIOB_ODR10:1; // GPIOB pin 10 output data
    uint32_t GPIOB_ODR11:1; // GPIOB pin 11 output data
    uint32_t GPIOB_ODR12:1; // GPIOB pin 12 output data
    uint32_t GPIOB_ODR13:1; // GPIOB pin 13 output data
    uint32_t GPIOB_ODR14:1; // GPIOB pin 14 output data
    uint32_t GPIOB_ODR15:1; // GPIOB pin 15 output data
}GPIOB_ODR_B_t;

typedef union
{
    GPIOB_ODR_B_t B;
    uint32_t U;
}GPIOB_ODR_Reg_t;

extern volatile GPIOB_ODR_Reg_t GPIOB_ODR_Reg;

typedef struct
{
    uint32_t GPIOC_ODR0:1; // GPIOC pin 0 output data
    uint32_t GPIOC_ODR1:1; // GPIOC pin 1 output data
    uint32_t GPIOC_ODR2:1; // GPIOC pin 2 output data
    uint32_t GPIOC_ODR3:1; // GPIOC pin 3 output data
    uint32_t GPIOC_ODR4:1; // GPIOC pin 4 output data
    uint32_t GPIOC_ODR5:1; // GPIOC pin 5 output data
    uint32_t GPIOC_ODR6:1; // GPIOC pin 6 output data
    uint32_t GPIOC_ODR7:1; // GPIOC pin 7 output data
    uint32_t GPIOC_ODR8:1; // GPIOC pin 8 output data
    uint32_t GPIOC_ODR9:1; // GPIOC pin 9 output data
    uint32_t GPIOC_ODR10:1; // GPIOC pin 10 output data
    uint32_t GPIOC_ODR11:1; // GPIOC pin 11 output data
    uint32_t GPIOC_ODR12:1; // GPIOC pin 12 output data
    uint32_t GPIOC_ODR13:1; // GPIOC pin 13 output data
    uint32_t GPIOC_ODR14:1; // GPIOC pin 14 output data
    uint32_t GPIOC_ODR15:1; // GPIOC pin 15 output data
}GPIOC_ODR_B_t;

typedef union
{
    GPIOC_ODR_B_t B;
    uint32_t U;
}GPIOC_ODR_Reg_t;

extern volatile GPIOC_ODR_Reg_t GPIOC_ODR_Reg;

typedef struct
{
    uint32_t GPIOD_ODR0:1; // GPIOD pin 0 output data
    uint32_t GPIOD_ODR1:1; // GPIOD pin 1 output data
    uint32_t GPIOD_ODR2:1; // GPIOD pin 2 output data
    uint32_t GPIOD_ODR3:1; // GPIOD pin 3 output data
    uint32_t GPIOD_ODR4:1; // GPIOD pin 4 output data
    uint32_t GPIOD_ODR5:1; // GPIOD pin 5 output data
    uint32_t GPIOD_ODR6:1; // GPIOD pin 6 output data
    uint32_t GPIOD_ODR7:1; // GPIOD pin 7 output data
    uint32_t GPIOD_ODR8:1; // GPIOD pin 8 output data
    uint32_t GPIOD_ODR9:1; // GPIOD pin 9 output data
    uint32_t GPIOD_ODR10:1; // GPIOD pin 10 output data
    uint32_t GPIOD_ODR11:1; // GPIOD pin 11 output data
    uint32_t GPIOD_ODR12:1; // GPIOD pin 12 output data
    uint32_t GPIOD_ODR13:1; // GPIOD pin 13 output data
    uint32_t GPIOD_ODR14:1; // GPIOD pin 14 output data
    uint32_t GPIOD_ODR15:1; // GPIOD pin 15 output data
}GPIOD_ODR_B_t;

typedef union
{
    GPIOD_ODR_B_t B;
    uint32_t U;
}GPIOD_ODR_Reg_t;

