rkalyan95/stm32_ll_drivers/stm32_ll_gpio/include/stm32l433_ll_gpio_cfg.h
extern volatile GPIOD_ODR_Reg_t GPIOD_ODR_Reg;

typedef struct
{
    uint32_t GPIOE_ODR0:1; // GPIOE pin 0 output data
    uint32_t GPIOE_ODR1:1; // GPIOE pin 1 output data
    uint32_t GPIOE_ODR2:1; // GPIOE pin 2 output data
    uint32_t GPIOE_ODR3:1; // GPIOE pin 3 output data
    uint32_t GPIOE_ODR4:1; // GPIOE pin 4 output data
    uint32_t GPIOE_ODR5:1; // GPIOE pin 5 output data
    uint32_t GPIOE_ODR6:1; // GPIOE pin 6 output data
    uint32_t GPIOE_ODR7:1; // GPIOE pin 7 output data
    uint32_t GPIOE_ODR8:1; // GPIOE pin 8 output data
    uint32_t GPIOE_ODR9:1; // GPIOE pin 9 output data
    uint32_t GPIOE_ODR10:1; // GPIOE pin 10 output data
    uint32_t GPIOE_ODR11:1; // GPIOE pin 11 output data
    uint32_t GPIOE_ODR12:1; // GPIOE pin 12 output data
    uint32_t GPIOE_ODR13:1; // GPIOE pin 13 output data
    uint32_t GPIOE_ODR14:1; // GPIOE pin 14 output data
    uint32_t GPIOE_ODR15:1; // GPIOE pin 15 output data
}GPIOE_ODR_B_t;

typedef union
{
    GPIOE_ODR_B_t B;
    uint32_t U;
}GPIOE_ODR_Reg_t;

extern volatile GPIOE_ODR_Reg_t GPIOE_ODR_Reg;

typedef struct
{
    uint32_t GPIOH_ODR0:1; // GPIOH pin 0 output data
    uint32_t GPIOH_ODR1:1; // GPIOH pin 1 output data
    uint32_t GPIOH_ODR2:1; // GPIOH pin 2 output data
    uint32_t GPIOH_ODR3:1; // GPIOH pin 3 output data
    uint32_t GPIOH_ODR4:1; // GPIOH pin 4 output data
    uint32_t GPIOH_ODR5:1; // GPIOH pin 5 output data
    uint32_t GPIOH_ODR6:1; // GPIOH pin 6 output data
    uint32_t GPIOH_ODR7:1; // GPIOH pin 7 output data
    uint32_t GPIOH_ODR8:1; // GPIOH pin 8 output data
    uint32_t GPIOH_ODR9:1; // GPIOH pin 9 output data
    uint32_t GPIOH_ODR10:1; // GPIOH pin 10 output data
    uint32_t GPIOH_ODR11:1; // GPIOH pin 11 output data
    uint32_t GPIOH_ODR12:1; // GPIOH pin 12 output data
    uint32_t GPIOH_ODR13:1; // GPIOH pin 13 output data
    uint32_t GPIOH_ODR14:1; // GPIOH pin 14 output data
    uint32_t GPIOH_ODR15:1; // GPIOH pin 15 output data
}GPIOH_ODR_B_t;

typedef union
{
    GPIOH_ODR_B_t B;
    uint32_t U;
}GPIOH_ODR_Reg_t;

extern volatile GPIOH_ODR_Reg_t GPIOH_ODR_Reg;

enum {
    GPIOA_BSRR_SET = 0x0, // Set bit in GPIOA_BSRR
    GPIOA_BSRR_RESET = 0x1 // Reset bit in GPIOA_BSRR
};

typedef struct
{
    uint32_t GPIOA_BS0 : 1; // GPIOA pin 0 bit set
    uint32_t GPIOA_BS1 : 1; // GPIOA pin 1
    uint32_t GPIOA_BS2 : 1; // GPIOA pin 2 bit set
    uint32_t GPIOA_BS3 : 1; // GPIOA pin 3
    uint32_t GPIOA_BS4 : 1; // GPIOA pin 4 bit set
    uint32_t GPIOA_BS5 : 1; // GPIOA pin 5
    uint32_t GPIOA_BS6 : 1; // GPIOA pin 6 bit set
    uint32_t GPIOA_BS7 : 1; // GPIOA pin 7
    uint32_t GPIOA_BS8 : 1; // GPIOA pin 8 bit set
    uint32_t GPIOA_BS9 : 1; // GPIOA pin 9
    uint32_t GPIOA_BS10 : 1; // GPIOA pin 10 bit set
    uint32_t GPIOA_BS11 : 1; // GPIOA pin 11
    uint32_t GPIOA_BS12 : 1; // GPIOA pin 12
    uint32_t GPIOA_BS13 : 1; // GPIOA pin 13
    uint32_t GPIOA_BS14 : 1; // GPIOA pin 14
    uint32_t GPIOA_BS15 : 1; // GPIOA pin 15
    uint32_t GPIOA_BR0 : 1; // GPIOB pin 0 bit set
    uint32_t GPIOA_BR1 : 1; // GPIOB pin 1
    uint32_t GPIOA_BR2 : 1; // GPIOB pin 2 bit
    uint32_t GPIOA_BR3 : 1; // GPIOB pin 3
    uint32_t GPIOA_BR4 : 1; // GPIOB pin 4 bit
    uint32_t GPIOA_BR5 : 1; // GPIOB pin 5
    uint32_t GPIOA_BR6 : 1; // GPIOB pin 6 bit
    uint32_t GPIOA_BR7 : 1; // GPIOB pin 7
    uint32_t GPIOA_BR8 : 1; // GPIOB pin 8 bit
    uint32_t GPIOA_BR9 : 1; // GPIOB pin 9
    uint32_t GPIOA_BR10 : 1; // GPIOB pin 10 bit
    uint32_t GPIOA_BR11 : 1; // GPIOB pin 11
    uint32_t GPIOA_BR12 : 1; // GPIOB pin 12
    uint32_t GPIOA_BR13 : 1; // GPIOB pin 13
    uint32_t GPIOA_BR14 : 1; // GPIOB pin 14
    uint32_t GPIOA_BR15 : 1; // GPIOB pin 15
}GPIOA_BSRR_B_t;    

typedef union
{
    GPIOA_BSRR_B_t B;
    uint32_t U;
}GPIOA_BSRR_Reg_t;

extern volatile GPIOA_BSRR_Reg_t GPIOA_BSRR_Reg;

typedef struct
{
    uint32_t GPIOB_BS0 : 1; // GPIOB pin 0 bit set
    uint32_t GPIOB_BS1 : 1; // GPIOB pin 1
    uint32_t GPIOB_BS2 : 1; // GPIOB pin 2 bit set
    uint32_t GPIOB_BS3 : 1; // GPIOB pin 3
    uint32_t GPIOB_BS4 : 1; // GPIOB pin 4 bit set
    uint32_t GPIOB_BS5 : 1; // GPIOB pin 5
    uint32_t GPIOB_BS6 : 1; // GPIOB pin 6 bit set
    uint32_t GPIOB_BS7 : 1; // GPIOB pin 7
    uint32_t GPIOB_BS8 : 1; // GPIOB pin 8 bit set
    uint32_t GPIOB_BS9 : 1; // GPIOB pin 9
    uint32_t GPIOB_BS10 : 1; // GPIOB pin 10 bit set
    uint32_t GPIOB_BS11 : 1; // GPIOB pin 11
    uint32_t GPIOB_BS12 : 1; // GPIOB pin 12
    uint32_t GPIOB_BS13 : 1; // GPIOB pin 13
    uint32_t GPIOB_BS14 : 1; // GPIOB pin 14
    uint32_t GPIOB_BS15 : 1; // GPIOB pin 15
    uint32_t GPIOB_BR0 : 1; // GPIOA pin 0 bit reset
    uint32_t GPIOB_BR1 : 1; // GPIOA pin 1
    uint32_t GPIOB_BR2 : 1; // GPIOA pin 2 bit reset
    uint32_t GPIOB_BR3 : 1; // GPIOA pin 3
    uint32_t GPIOB_BR4 : 1; // GPIOA pin 4 bit reset
    uint32_t GPIOB_BR5 : 1; // GPIOA pin 5
    uint32_t GPIOB_BR6 : 1; // GPIOA pin 6 bit reset
    uint32_t GPIOB_BR7 : 1; // GPIOA pin 7
    uint32_t GPIOB_BR8 : 1; // GPIOA pin 8 bit reset
    uint32_t GPIOB_BR9 : 1; // GPIOA pin 9
    uint32_t GPIOB_BR10 : 1; // GPIOA pin 10 bit
    uint32_t GPIOB_BR11 : 1; // GPIOA pin 11
    uint32_t GPIOB_BR12 : 1; // GPIOA pin 12
    uint32_t GPIOB_BR13 : 1; // GPIOA pin 13
    uint32_t GPIOB_BR14 : 1; // GPIOA pin 14
    uint32_t GPIOB_BR15 : 1; // GPIOA pin 15
}GPIOB_BSRR_B_t;

typedef union
{
    GPIOB_BSRR_B_t B;
    uint32_t U;
}GPIOB_BSRR_Reg_t;

extern volatile GPIOB_BSRR_Reg_t GPIOB_BSRR_Reg;

typedef struct
{
    uint32_t GPIOC_BS0 : 1; // GPIOC pin 0 bit set
    uint32_t GPIOC_BS1 : 1; // GPIOC pin 1
    uint32_t GPIOC_BS2 : 1; // GPIOC pin 2 bit set
    uint32_t GPIOC_BS3 : 1; // GPIOC pin 3
    uint32_t GPIOC_BS4 : 1; // GPIOC pin 4 bit set
    uint32_t GPIOC_BS5 : 1; // GPIOC pin 5
    uint32_t GPIOC_BS6 : 1; // GPIOC pin 6 bit set
    uint32_t GPIOC_BS7 : 1; // GPIOC pin 7
    uint32_t GPIOC_BS8 : 1; // GPIOC pin 8 bit set
    uint32_t GPIOC_BS9 : 1; // GPIOC pin 9
    uint32_t GPIOC_BS10 : 1; // GPIOC pin 10 bit set
    uint32_t GPIOC_BS11 : 1; // GPIOC pin 11
    uint32_t GPIOC_BS12 : 1; // GPIOC pin 12
    uint32_t GPIOC_BS13 : 1; // GPIOC pin 13
    uint32_t GPIOC_BS14 : 1; // GPIOC pin 14
    uint32_t GPIOC_BS15 : 1; // GPIOC pin 15
    uint32_t GPIOC_BR0 : 1; // GPIOD pin 0 bit reset
    uint32_t GPIOC_BR1 : 1; // GPIOD pin 1
    uint32_t GPIOC_BR2 : 1; // GPIOD pin 2 bit reset
    uint32_t GPIOC_BR3 : 1; // GPIOD pin 3
    uint32_t GPIOC_BR4 : 1; // GPIOD pin 4 bit reset
    uint32_t GPIOC_BR5 : 1; // GPIOD pin 5
    uint32_t GPIOC_BR6 : 1; // GPIOD pin 6 bit reset
    uint32_t GPIOC_BR7 : 1; // GPIOD pin 7
    uint32_t GPIOC_BR8 : 1; // GPIOD pin 8 bit reset
    uint32_t GPIOC_BR9 : 1; // GPIOD pin 9
    uint32_t GPIOC_BR10 : 1; // GPIOD pin 10 bit reset
    uint32_t GPIOC_BR11 : 1; // GPIOD pin 11    
    uint32_t GPIOC_BR12 : 1; // GPIOD pin 12 bit reset
    uint32_t GPIOC_BR13 : 1; // GPIOD pin 13
    uint32_t GPIOC_BR14 : 1; // GPIOD pin 14 bit reset
    uint32_t GPIOC_BR15 : 1; // GPIOD pin 15
}GPIOC_BSRR_B_t;

typedef union
{
    GPIOC_BSRR_B_t B;
    uint32_t U;
}GPIOC_BSRR_Reg_t;

extern volatile GPIOC_BSRR_Reg_t GPIOC_BSRR_Reg;

typedef struct
{
    uint32_t GPIOD_BS0 : 1; // GPIOD pin 0 bit set
    uint32_t GPIOD_BS1 : 1; // GPIOD pin 1
    uint32_t GPIOD_BS2 : 1; // GPIOD pin 2 bit set
    uint32_t GPIOD_BS3 : 1; // GPIOD pin 3
    uint32_t GPIOD_BS4 : 1; // GPIOD pin 4 bit set
    uint32_t GPIOD_BS5 : 1; // GPIOD pin 5
    uint32_t GPIOD_BS6 : 1; // GPIOD pin 6 bit set
    uint32_t GPIOD_BS7 : 1; // GPIOD pin 7
    uint32_t GPIOD_BS8 : 1; // GPIOD pin 8 bit set
    uint32_t GPIOD_BS9 : 1; // GPIOD pin 9
    uint32_t GPIOD_BS10 : 1; // GPIOD pin 10 bit set
    uint32_t GPIOD_BS11 : 1; // GPIOD pin 11
    uint32_t GPIOD_BS12 : 1; // GPIOD pin 12 bit set
    uint32_t GPIOD_BS13 : 1; // GPIOD pin 13
    uint32_t GPIOD_BS14 : 1; // GPIOD pin 14
    uint32_t GPIOD_BS15 : 1; // GPIOD pin 15
    uint32_t GPIOD_BR0 : 1; // GPIOE pin 0 bit reset
    uint32_t GPIOD_BR1 : 1; // GPIOE pin 1
    uint32_t GPIOD_BR2 : 1; // GPIOE pin 2 bit reset
    uint32_t GPIOD_BR3 : 1; // GPIOE pin 3
    uint32_t GPIOD_BR4 : 1; // GPIOE pin 4 bit reset
    uint32_t GPIOD_BR5 : 1; // GPIOE pin 5
    uint32_t GPIOD_BR6 : 1; // GPIOE pin 6 bit reset
    uint32_t GPIOD_BR7 : 1; // GPIOE pin 7  
    uint32_t GPIOD_BR8 : 1; // GPIOE pin 8 bit reset
    uint32_t GPIOD_BR9 : 1; // GPIOE pin 9
    uint32_t GPIOD_BR10 : 1; // GPIOE pin 10 bit reset
    uint32_t GPIOD_BR11 : 1; // GPIOE pin 11
    uint32_t GPIOD_BR12 : 1; // GPIOE pin 12 bit reset
    uint32_t GPIOD_BR13 : 1; // GPIOE pin 13
    uint32_t GPIOD_BR14 : 1; // GPIOE pin 14 bit reset
    uint32_t GPIOD_BR15 : 1; // GPIOE pin 15
}GPIOD_BSRR_B_t;

typedef union
{
    GPIOD_BSRR_B_t B;
    uint32_t U;
}GPIOD_BSRR_Reg_t;

extern volatile GPIOD_BSRR_Reg_t GPIOD_BSRR_Reg;

typedef struct
{
    uint32_t GPIOE_BS0 : 1; // GPIOE pin 0 bit set
    uint32_t GPIOE_BS1 : 1; // GPIOE pin 1
    uint32_t GPIOE_BS2 : 1; // GPIOE pin 2 bit set
    uint32_t GPIOE_BS3 : 1; // GPIOE pin 3
    uint32_t GPIOE_BS4 : 1; // GPIOE pin 4 bit set
    uint32_t GPIOE_BS5 : 1; // GPIOE pin 5
    uint32_t GPIOE_BS6 : 1; // GPIOE pin 6 bit set
    uint32_t GPIOE_BS7 : 1; // GPIOE pin 7
    uint32_t GPIOE_BS8 : 1; // GPIOE pin 8 bit set
    uint32_t GPIOE_BS9 : 1; // GPIOE pin 9
    uint32_t GPIOE_BS10 : 1; // GPIOE pin 10 bit set
    uint32_t GPIOE_BS11 : 1; // GPIOE pin 11
    uint32_t GPIOE_BS12 : 1; // GPIOE pin 12 bit set
    uint32_t GPIOE_BS13 : 1; // GPIOE pin 13
    uint32_t GPIOE_BS14 : 1; // GPIOE pin 14
    uint32_t GPIOE_BS15 : 1; // GPIOE pin 15
    uint32_t GPIOE_BR0 : 1; // GPIOH pin 0 bit reset
    uint32_t GPIOE_BR1 : 1; // GPIOH pin 1
    uint32_t GPIOE_BR2 : 1; // GPIOH pin 2 bit reset
    uint32_t GPIOE_BR3 : 1; // GPIOH pin 3
    uint32_t GPIOE_BR4 : 1; // GPIOH pin 4 bit reset
    uint32_t GPIOE_BR5 : 1; // GPIOH pin 5
    uint32_t GPIOE_BR6 : 1; // GPIOH pin 6 bit reset
    uint32_t GPIOE_BR7 : 1; // GPIOH pin 7  
    uint32_t GPIOE_BR8 : 1; // GPIOH pin 8 bit reset
    uint32_t GPIOE_BR9 : 1; // GPIOH pin 9
    uint32_t GPIOE_BR10 : 1; // GPIOH pin 10 bit reset
    uint32_t GPIOE_BR11 : 1; // GPIOH pin 11
    uint32_t GPIOE_BR12 : 1; // GPIOH pin 12 bit reset
    uint32_t GPIOE_BR13 : 1; // GPIOH pin 13
    uint32_t GPIOE_BR14 : 1; // GPIOH pin 14 bit reset
    uint32_t GPIOE_BR15 : 1; // GPIOH pin 15
}GPIOE_BSRR_B_t;

typedef union
{
    GPIOE_BSRR_B_t B;
    uint32_t U;
}GPIOE_BSRR_Reg_t;

extern volatile GPIOE_BSRR_Reg_t GPIOE_BSRR_Reg;

typedef struct
{
    uint32_t GPIOH_BS0 : 1; // GPIOH pin 0 bit set
    uint32_t GPIOH_BS1 : 1; // GPIOH pin 1
    uint32_t GPIOH_BS2 : 1; // GPIOH pin 2 bit set
    uint32_t GPIOH_BS3 : 1; // GPIOH pin 3
    uint32_t GPIOH_BS4 : 1; // GPIOH pin 4 bit set
    uint32_t GPIOH_BS5 : 1; // GPIOH pin 5
    uint32_t GPIOH_BS6 : 1; // GPIOH pin 6 bit set
    uint32_t GPIOH_BS7 : 1; // GPIOH pin 7
    uint32_t GPIOH_BS8 : 1; // GPIOH pin 8 bit set
    uint32_t GPIOH_BS9 : 1; // GPIOH pin 9
    uint32_t GPIOH_BS10 : 1; // GPIOH pin 10 bit set
    uint32_t GPIOH_BS11 : 1; // GPIOH pin 11
    uint32_t GPIOH_BS12 : 1; // GPIOH pin 12 bit set
    uint32_t GPIOH_BS13 : 1; // GPIOH pin 13
    uint32_t GPIOH_BS14 : 1; // GPIOH pin 14
    uint32_t GPIOH_BS15 : 1; // GPIOH pin 15
    uint32_t GPIOH_BR0 : 1; // not used, reserved for future use    
    uint32_t GPIOH_BR1 : 1; // not used, reserved for future use
    uint32_t GPIOH_BR2 : 1; // not used, reserved for future
    uint32_t GPIOH_BR3 : 1; // not used, reserved for future use
    uint32_t GPIOH_BR4 : 1; // not used, reserved for future
    uint32_t GPIOH_BR5 : 1; // not used, reserved for future use
    uint32_t GPIOH_BR6 : 1; // not used, reserved for future use
    uint32_t GPIOH_BR7 : 1; // not used, reserved for future
    uint32_t GPIOH_BR8 : 1; // not used, reserved for future use
    uint32_t GPIOH_BR9 : 1; // not used, reserved for future
    uint32_t GPIOH_BR10 : 1; // not used, reserved for future use
    uint32_t GPIOH_BR11 : 1; // not used, reserved for future
    uint32_t GPIOH_BR12 : 1; // not used, reserved for future use
    uint32_t GPIOH_BR13 : 1; // not used, reserved for future
    uint32_t GPIOH_BR14 : 1; // not used, reserved for future
    uint32_t GPIOH_BR15 : 1; // not used, reserved for future
}GPIOH_BSRR_B_t;

typedef union
{
    GPIOH_BSRR_B_t B;
    uint32_t U;
}GPIOH_BSRR_Reg_t;

