rkalyan95/stm32_ll_drivers/stm32_ll_gpio/include/stm32l433_ll_gpio_cfg.h
extern volatile GPIOH_BSRR_Reg_t GPIOH_BSRR_Reg;

enum {
    LOCK = 0x1, // Lock bit
    UNLOCK = 0x0 // Unlock bit
};
typedef struct
{
    uint32_t GPIOA_LCK0:1; // GPIOA pin 0 lock bit
    uint32_t GPIOA_LCK1:1; // GPIOA pin 1 lock bit
    uint32_t GPIOA_LCK2:1; // GPIOA pin 2 lock bit
    uint32_t GPIOA_LCK3:1; // GPIOA pin 3 lock bit
    uint32_t GPIOA_LCK4:1; // GPIOA pin 4 lock bit
    uint32_t GPIOA_LCK5:1; // GPIOA pin 5 lock bit
    uint32_t GPIOA_LCK6:1; // GPIOA pin 6 lock bit
    uint32_t GPIOA_LCK7:1; // GPIOA pin 7 lock bit
    uint32_t GPIOA_LCK8:1; // GPIOA pin 8 lock bit
    uint32_t GPIOA_LCK9:1; // GPIOA pin 9 lock bit
    uint32_t GPIOA_LCK10:1; // GPIOA pin 10 lock bit
    uint32_t GPIOA_LCK11:1; // GPIOA pin 11 lock bit
    uint32_t GPIOA_LCK12:1; // GPIOA pin 12 lock bit
    uint32_t GPIOA_LCK13:1; // GPIOA pin 13 lock bit
    uint32_t GPIOA_LCK14:1; // GPIOA pin 14 lock bit
    uint32_t GPIOA_LCK15:1; // GPIOA pin 15 lock bit
    uint32_t GPIOA_LCKK:1; // GPIOA lock key
}GPIOA_LCKR_B_t;

typedef union
{
    GPIOA_LCKR_B_t B;
    uint32_t U;
}GPIOA_LCKR_Reg_t;

extern volatile GPIOA_LCKR_Reg_t GPIOA_LCKR_Reg;

typedef struct
{
    uint32_t GPIOB_LCK0:1; // GPIOB pin 0 lock bit
    uint32_t GPIOB_LCK1:1; // GPIOB pin 1 lock bit
    uint32_t GPIOB_LCK2:1; // GPIOB pin 2 lock bit
    uint32_t GPIOB_LCK3:1; // GPIOB pin 3 lock bit
    uint32_t GPIOB_LCK4:1; // GPIOB pin 4 lock bit
    uint32_t GPIOB_LCK5:1; // GPIOB pin 5 lock bit
    uint32_t GPIOB_LCK6:1; // GPIOB pin 6 lock bit
    uint32_t GPIOB_LCK7:1; // GPIOB pin 7 lock bit
    uint32_t GPIOB_LCK8:1; // GPIOB pin 8 lock bit
    uint32_t GPIOB_LCK9:1; // GPIOB pin 9 lock bit
    uint32_t GPIOB_LCK10:1; // GPIOB pin 10 lock bit
    uint32_t GPIOB_LCK11:1; // GPIOB pin 11 lock bit
    uint32_t GPIOB_LCK12:1; // GPIOB pin 12 lock bit
    uint32_t GPIOB_LCK13:1; // GPIOB pin 13 lock bit
    uint32_t GPIOB_LCK14:1; // GPIOB pin 14 lock bit
    uint32_t GPIOB_LCK15:1; // GPIOB pin 15 lock bit
    uint32_t GPIOB_LCKK:1; // GPIOB lock key
}GPIOB_LCKR_B_t;

typedef union
{
    GPIOB_LCKR_B_t B;
    uint32_t U;
}GPIOB_LCKR_Reg_t;

extern volatile GPIOB_LCKR_Reg_t GPIOB_LCKR_Reg;

typedef struct
{
    uint32_t GPIOC_LCK0:1; // GPIOC pin 0 lock bit
    uint32_t GPIOC_LCK1:1; // GPIOC pin 1 lock bit
    uint32_t GPIOC_LCK2:1; // GPIOC pin 2 lock bit
    uint32_t GPIOC_LCK3:1; // GPIOC pin 3 lock bit
    uint32_t GPIOC_LCK4:1; // GPIOC pin 4 lock bit
    uint32_t GPIOC_LCK5:1; // GPIOC pin 5 lock bit
    uint32_t GPIOC_LCK6:1; // GPIOC pin 6 lock bit
    uint32_t GPIOC_LCK7:1; // GPIOC pin 7 lock bit
    uint32_t GPIOC_LCK8:1; // GPIOC pin 8 lock bit
    uint32_t GPIOC_LCK9:1; // GPIOC pin 9 lock bit
    uint32_t GPIOC_LCK10:1; // GPIOC pin 10 lock bit
    uint32_t GPIOC_LCK11:1; // GPIOC pin 11 lock bit
    uint32_t GPIOC_LCK12:1; // GPIOC pin 12 lock bit
    uint32_t GPIOC_LCK13:1; // GPIOC pin 13 lock bit
    uint32_t GPIOC_LCK14:1; // GPIOC pin 14 lock bit
    uint32_t GPIOC_LCK15:1; // GPIOC pin 15 lock bit
    uint32_t GPIOC_LCKK:1; // GPIOC lock key
}GPIOC_LCKR_B_t;

typedef union
{
    GPIOC_LCKR_B_t B;
    uint32_t U;
}GPIOC_LCKR_Reg_t;

extern volatile GPIOC_LCKR_Reg_t GPIOC_LCKR_Reg;

typedef struct
{
    uint32_t GPIOD_LCK0:1; // GPIOD pin 0 lock bit
    uint32_t GPIOD_LCK1:1; // GPIOD pin 1 lock bit
    uint32_t GPIOD_LCK2:1; // GPIOD pin 2 lock bit
    uint32_t GPIOD_LCK3:1; // GPIOD pin 3 lock bit
    uint32_t GPIOD_LCK4:1; // GPIOD pin 4 lock bit
    uint32_t GPIOD_LCK5:1; // GPIOD pin 5 lock bit
    uint32_t GPIOD_LCK6:1; // GPIOD pin 6 lock bit
    uint32_t GPIOD_LCK7:1; // GPIOD pin 7 lock bit
    uint32_t GPIOD_LCK8:1; // GPIOD pin 8 lock bit
    uint32_t GPIOD_LCK9:1; // GPIOD pin 9 lock bit
    uint32_t GPIOD_LCK10:1; // GPIOD pin 10 lock bit
    uint32_t GPIOD_LCK11:1; // GPIOD pin 11 lock bit
    uint32_t GPIOD_LCK12:1; // GPIOD pin 12 lock bit
    uint32_t GPIOD_LCK13:1; // GPIOD pin 13 lock bit
    uint32_t GPIOD_LCK14:1; // GPIOD pin 14 lock bit
    uint32_t GPIOD_LCK15:1; // GPIOD pin 15 lock bit
    uint32_t GPIOD_LCKK:1; // GPIOD lock key
}GPIOD_LCKR_B_t;

typedef union
{
    GPIOD_LCKR_B_t B;
    uint32_t U;
}GPIOD_LCKR_Reg_t;

extern volatile GPIOD_LCKR_Reg_t GPIOD_LCKR_Reg;

typedef struct
{
    uint32_t GPIOE_LCK0:1; // GPIOE pin 0 lock bit
    uint32_t GPIOE_LCK1:1; // GPIOE pin 1 lock bit
    uint32_t GPIOE_LCK2:1; // GPIOE pin 2 lock bit
    uint32_t GPIOE_LCK3:1; // GPIOE pin 3 lock bit
    uint32_t GPIOE_LCK4:1; // GPIOE pin 4 lock bit
    uint32_t GPIOE_LCK5:1; // GPIOE pin 5 lock bit
    uint32_t GPIOE_LCK6:1; // GPIOE pin 6 lock bit
    uint32_t GPIOE_LCK7:1; // GPIOE pin 7 lock bit
    uint32_t GPIOE_LCK8:1; // GPIOE pin 8 lock bit
    uint32_t GPIOE_LCK9:1; // GPIOE pin 9 lock bit
    uint32_t GPIOE_LCK10:1; // GPIOE pin 10 lock bit
    uint32_t GPIOE_LCK11:1; // GPIOE pin 11 lock bit
    uint32_t GPIOE_LCK12:1; // GPIOE pin 12 lock bit
    uint32_t GPIOE_LCK13:1; // GPIOE pin 13 lock bit
    uint32_t GPIOE_LCK14:1; // GPIOE pin 14 lock bit
    uint32_t GPIOE_LCK15:1; // GPIOE pin 15 lock bit
    uint32_t GPIOE_LCKK:1; // GPIOE lock key    
}GPIOE_LCKR_B_t;

typedef union
{
    GPIOE_LCKR_B_t B;
    uint32_t U;
}GPIOE_LCKR_Reg_t;

extern volatile GPIOE_LCKR_Reg_t GPIOE_LCKR_Reg;

typedef struct
{
    uint32_t GPIOH_LCK0:1; // GPIOH pin 0 lock bit
    uint32_t GPIOH_LCK1:1; // GPIOH pin 1 lock bit
    uint32_t GPIOH_LCK2:1; // GPIOH pin 2 lock bit
    uint32_t GPIOH_LCK3:1; // GPIOH pin 3 lock bit
    uint32_t GPIOH_LCK4:1; // GPIOH pin 4 lock bit
    uint32_t GPIOH_LCK5:1; // GPIOH pin 5 lock bit
    uint32_t GPIOH_LCK6:1; // GPIOH pin 6 lock bit
    uint32_t GPIOH_LCK7:1; // GPIOH pin 7 lock bit
    uint32_t GPIOH_LCK8:1; // GPIOH pin 8 lock bit
    uint32_t GPIOH_LCK9:1; // GPIOH pin 9 lock bit
    uint32_t GPIOH_LCK10:1; // GPIOH pin 10 lock bit
    uint32_t GPIOH_LCK11:1; // GPIOH pin 11 lock bit
    uint32_t GPIOH_LCK12:1; // GPIOH pin 12 lock bit
    uint32_t GPIOH_LCK13:1; // GPIOH pin 13 lock bit
    uint32_t GPIOH_LCK14:1; // GPIOH pin 14 lock bit
    uint32_t GPIOH_LCK15:1; // GPIOH pin 15 lock bit
    uint32_t GPIOH_LCKK:1; // GPIOH lock key
}GPIOH_LCKR_B_t;

typedef union
{
    GPIOH_LCKR_B_t B;
    uint32_t U;
}GPIOH_LCKR_Reg_t;

extern volatile GPIOH_LCKR_Reg_t GPIOH_LCKR_Reg;

enum {
    GPIOx_AFRL0 = 0x0, // GPIOA pin 0 alternate function low
    GPIOx_AFRL1 = 0x1, // GPIOA pin 1 alternate function low
    GPIOx_AFRL2 = 0x2, // GPIOA pin 2 alternate function low
    GPIOx_AFRL3 = 0x3, // GPIOA pin 3 alternate function low
    GPIOx_AFRL4 = 0x4, // GPIOA pin 4 alternate function low
    GPIOx_AFRL5 = 0x5, // GPIOA pin 5 alternate function low
    GPIOx_AFRL6 = 0x6, // GPIOA pin 6 alternate function low
    GPIOx_AFRL7 = 0x7, // GPIOA pin 7 alternate function low
};

typedef struct
{
    uint32_t GPIOA_AFRL0:4; // GPIOA pin 0 alternate function low
    uint32_t GPIOA_AFRL1:4; // GPIOA pin 1 alternate function low
    uint32_t GPIOA_AFRL2:4; // GPIOA pin 2 alternate function low
    uint32_t GPIOA_AFRL3:4; // GPIOA pin 3 alternate function low
    uint32_t GPIOA_AFRL4:4; // GPIOA pin 4 alternate function low
    uint32_t GPIOA_AFRL5:4; // GPIOA pin 5 alternate function low
    uint32_t GPIOA_AFRL6:4; // GPIOA pin 6 alternate function low
    uint32_t GPIOA_AFRL7:4; // GPIOA pin 7 alternate function low
}GPIOA_AFRL_B_t;

typedef union
{
    GPIOA_AFRL_B_t B;
    uint32_t U;
}GPIOA_AFRL_Reg_t;

extern volatile GPIOA_AFRL_Reg_t GPIOA_AFRL_Reg;

typedef struct
{
    uint32_t GPIOB_AFRL0:4; // GPIOB pin 0 alternate function low
    uint32_t GPIOB_AFRL1:4; // GPIOB pin 1 alternate function low
    uint32_t GPIOB_AFRL2:4; // GPIOB pin 2 alternate function low
    uint32_t GPIOB_AFRL3:4; // GPIOB pin 3 alternate function low
    uint32_t GPIOB_AFRL4:4; // GPIOB pin 4 alternate function low
    uint32_t GPIOB_AFRL5:4; // GPIOB pin 5 alternate function low
    uint32_t GPIOB_AFRL6:4; // GPIOB pin 6 alternate function low
    uint32_t GPIOB_AFRL7:4; // GPIOB pin 7 alternate function low
}GPIOB_AFRL_B_t;

typedef union
{
    GPIOB_AFRL_B_t B;
    uint32_t U;
}GPIOB_AFRL_Reg_t;

