rkalyan95/stm32_ll_drivers/stm32_ll_gpio/include/stm32l433_ll_gpio_cfg.h
extern volatile GPIOB_AFRL_Reg_t GPIOB_AFRL_Reg;

typedef struct
{
    uint32_t GPIOC_AFRL0:4; // GPIOC pin 0 alternate function low
    uint32_t GPIOC_AFRL1:4; // GPIOC pin 1 alternate function low
    uint32_t GPIOC_AFRL2:4; // GPIOC pin 2 alternate function low
    uint32_t GPIOC_AFRL3:4; // GPIOC pin 3 alternate function low
    uint32_t GPIOC_AFRL4:4; // GPIOC pin 4 alternate function low
    uint32_t GPIOC_AFRL5:4; // GPIOC pin 5 alternate function low
    uint32_t GPIOC_AFRL6:4; // GPIOC pin 6 alternate function low
    uint32_t GPIOC_AFRL7:4; // GPIOC pin 7 alternate function low
}GPIOC_AFRL_B_t;

typedef union
{
    GPIOC_AFRL_B_t B;
    uint32_t U;
}GPIOC_AFRL_Reg_t;

extern volatile GPIOC_AFRL_Reg_t GPIOC_AFRL_Reg;

typedef struct
{
    uint32_t GPIOD_AFRL0:4; // GPIOD pin 0 alternate function low
    uint32_t GPIOD_AFRL1:4; // GPIOD pin 1 alternate function low
    uint32_t GPIOD_AFRL2:4; // GPIOD pin 2 alternate function low
    uint32_t GPIOD_AFRL3:4; // GPIOD pin 3 alternate function low
    uint32_t GPIOD_AFRL4:4; // GPIOD pin 4 alternate function low
    uint32_t GPIOD_AFRL5:4; // GPIOD pin 5 alternate function low
    uint32_t GPIOD_AFRL6:4; // GPIOD pin 6 alternate function low
    uint32_t GPIOD_AFRL7:4; // GPIOD pin 7 alternate function low
}GPIOD_AFRL_B_t;

typedef union
{
    GPIOD_AFRL_B_t B;
    uint32_t U;
}GPIOD_AFRL_Reg_t;

extern volatile GPIOD_AFRL_Reg_t GPIOD_AFRL_Reg;

typedef struct
{
    uint32_t GPIOE_AFRL0:4; // GPIOE pin 0 alternate function low
    uint32_t GPIOE_AFRL1:4; // GPIOE pin 1 alternate function low
    uint32_t GPIOE_AFRL2:4; // GPIOE pin 2 alternate function low
    uint32_t GPIOE_AFRL3:4; // GPIOE pin 3 alternate function low
    uint32_t GPIOE_AFRL4:4; // GPIOE pin 4 alternate function low
    uint32_t GPIOE_AFRL5:4; // GPIOE pin 5 alternate function low
    uint32_t GPIOE_AFRL6:4; // GPIOE pin 6 alternate function low
    uint32_t GPIOE_AFRL7:4; // GPIOE pin 7 alternate function low
}GPIOE_AFRL_B_t;    

typedef union
{
    GPIOE_AFRL_B_t B;
    uint32_t U;
}GPIOE_AFRL_Reg_t;

extern volatile GPIOE_AFRL_Reg_t GPIOE_AFRL_Reg;

typedef struct
{
    uint32_t GPIOH_AFRL0:4; // GPIOH pin 0 alternate function low
    uint32_t GPIOH_AFRL1:4; // GPIOH pin 1 alternate function low
    uint32_t GPIOH_AFRL2:4; // GPIOH pin 2 alternate function low
    uint32_t GPIOH_AFRL3:4; // GPIOH pin 3 alternate function low
    uint32_t GPIOH_AFRL4:4; // GPIOH pin 4 alternate function low
    uint32_t GPIOH_AFRL5:4; // GPIOH pin 5 alternate function low
    uint32_t GPIOH_AFRL6:4; // GPIOH pin 6 alternate function low
    uint32_t GPIOH_AFRL7:4; // GPIOH pin 7 alternate function low
}GPIOH_AFRL_B_t;

typedef union
{
    GPIOH_AFRL_B_t B;
    uint32_t U;
}GPIOH_AFRL_Reg_t;

extern volatile GPIOH_AFRL_Reg_t GPIOH_AFRL_Reg;

enum {
    GPIOx_AFRH0 = 0x0, // GPIOA pin 8 alternate function high
    GPIOx_AFRH1 = 0x1, // GPIOA pin 9 alternate function high
    GPIOx_AFRH2 = 0x2, // GPIOA pin 10 alternate function high
    GPIOx_AFRH3 = 0x3, // GPIOA pin 11 alternate function high
    GPIOx_AFRH4 = 0x4, // GPIOA pin 12 alternate function high
    GPIOx_AFRH5 = 0x5, // GPIOA pin 13 alternate function high
    GPIOx_AFRH6 = 0x6, // GPIOA pin 14 alternate function high
    GPIOx_AFRH7 = 0x7, // GPIOA pin 15 alternate function high
};

typedef struct
{
    uint32_t GPIOA_AFRH0:4; // GPIOA pin 8 alternate function high
    uint32_t GPIOA_AFRH1:4; // GPIOA pin 9 alternate function high
    uint32_t GPIOA_AFRH2:4; // GPIOA pin 10 alternate function high
    uint32_t GPIOA_AFRH3:4; // GPIOA pin 11 alternate function high
    uint32_t GPIOA_AFRH4:4; // GPIOA pin 12 alternate function high
    uint32_t GPIOA_AFRH5:4; // GPIOA pin 13 alternate function high
    uint32_t GPIOA_AFRH6:4; // GPIOA pin 14 alternate function high
    uint32_t GPIOA_AFRH7:4; // GPIOA pin 15 alternate function high
}GPIOA_AFRH_B_t;

typedef union
{
    GPIOA_AFRH_B_t B;
    uint32_t U;
}GPIOA_AFRH_Reg_t;

extern volatile GPIOA_AFRH_Reg_t GPIOA_AFRH_Reg;

typedef struct
{
    uint32_t GPIOB_AFRH0:4; // GPIOB pin 8 alternate function high
    uint32_t GPIOB_AFRH1:4; // GPIOB pin 9 alternate function high
    uint32_t GPIOB_AFRH2:4; // GPIOB pin 10 alternate function high
    uint32_t GPIOB_AFRH3:4; // GPIOB pin 11 alternate function high
    uint32_t GPIOB_AFRH4:4; // GPIOB pin 12 alternate function high
    uint32_t GPIOB_AFRH5:4; // GPIOB pin 13 alternate function high
    uint32_t GPIOB_AFRH6:4; // GPIOB pin 14 alternate function high
    uint32_t GPIOB_AFRH7:4; // GPIOB pin 15 alternate function high
}GPIOB_AFRH_B_t;    

typedef union
{
    GPIOB_AFRH_B_t B;
    uint32_t U;
}GPIOB_AFRH_Reg_t;

extern volatile GPIOB_AFRH_Reg_t GPIOB_AFRH_Reg;

typedef struct
{
    uint32_t GPIOC_AFRH0:4; // GPIOC pin 8 alternate function high
    uint32_t GPIOC_AFRH1:4; // GPIOC pin 9 alternate function high
    uint32_t GPIOC_AFRH2:4; // GPIOC pin 10 alternate function high
    uint32_t GPIOC_AFRH3:4; // GPIOC pin 11 alternate function high
    uint32_t GPIOC_AFRH4:4; // GPIOC pin 12 alternate function high
    uint32_t GPIOC_AFRH5:4; // GPIOC pin 13 alternate function high
    uint32_t GPIOC_AFRH6:4; // GPIOC pin 14 alternate function high
    uint32_t GPIOC_AFRH7:4; // GPIOC pin 15 alternate function high
}GPIOC_AFRH_B_t;

typedef union
{
    GPIOC_AFRH_B_t B;
    uint32_t U;
}GPIOC_AFRH_Reg_t;

extern volatile GPIOC_AFRH_Reg_t GPIOC_AFRH_Reg;

typedef struct
{
    uint32_t GPIOD_AFRH0:4; // GPIOD pin 8 alternate function high
    uint32_t GPIOD_AFRH1:4; // GPIOD pin 9 alternate function high
    uint32_t GPIOD_AFRH2:4; // GPIOD pin 10 alternate function high
    uint32_t GPIOD_AFRH3:4; // GPIOD pin 11 alternate function high
    uint32_t GPIOD_AFRH4:4; // GPIOD pin 12 alternate function high
    uint32_t GPIOD_AFRH5:4; // GPIOD pin 13 alternate function high
    uint32_t GPIOD_AFRH6:4; // GPIOD pin 14 alternate function high
    uint32_t GPIOD_AFRH7:4; // GPIOD pin 15 alternate function high
}GPIOD_AFRH_B_t;

typedef union
{
    GPIOD_AFRH_B_t B;
    uint32_t U;
}GPIOD_AFRH_Reg_t;

