rkalyan95/stm32_ll_drivers/stm32_ll_gpio/include/stm32l433_ll_gpio_cfg.h
extern volatile GPIOD_AFRH_Reg_t GPIOD_AFRH_Reg;

typedef struct
{
    uint32_t GPIOE_AFRH0:4; // GPIOE pin 8 alternate function high
    uint32_t GPIOE_AFRH1:4; // GPIOE pin 9 alternate function high
    uint32_t GPIOE_AFRH2:4; // GPIOE pin 10 alternate function high
    uint32_t GPIOE_AFRH3:4; // GPIOE pin 11 alternate function high
    uint32_t GPIOE_AFRH4:4; // GPIOE pin 12 alternate function high
    uint32_t GPIOE_AFRH5:4; // GPIOE pin 13 alternate function high
    uint32_t GPIOE_AFRH6:4; // GPIOE pin 14 alternate function high
    uint32_t GPIOE_AFRH7:4; // GPIOE pin 15 alternate function high
}GPIOE_AFRH_B_t;

typedef union
{
    GPIOE_AFRH_B_t B;
    uint32_t U;
}GPIOE_AFRH_Reg_t;

extern volatile GPIOE_AFRH_Reg_t GPIOE_AFRH_Reg;

typedef struct
{
    uint32_t GPIOH_AFRH0:4; // GPIOH pin 8 alternate function high
    uint32_t GPIOH_AFRH1:4; // GPIOH pin 9 alternate function high
    uint32_t GPIOH_AFRH2:4; // GPIOH pin 10 alternate function high
    uint32_t GPIOH_AFRH3:4; // GPIOH pin 11 alternate function high
    uint32_t GPIOH_AFRH4:4; // GPIOH pin 12 alternate function high
    uint32_t GPIOH_AFRH5:4; // GPIOH pin 13 alternate function high
    uint32_t GPIOH_AFRH6:4; // GPIOH pin 14 alternate function high
    uint32_t GPIOH_AFRH7:4; // GPIOH pin 15 alternate function high
}GPIOH_AFRH_B_t;

typedef union
{
    GPIOH_AFRH_B_t B;
    uint32_t U;
}GPIOH_AFRH_Reg_t;

extern volatile GPIOH_AFRH_Reg_t GPIOH_AFRH_Reg;

typedef struct
{
    uint32_t GPIOA_BRR0:1; // GPIOA pin 0 bit reset
    uint32_t GPIOA_BRR1:1; // GPIOA pin 1
    uint32_t GPIOA_BRR2:1; // GPIOA pin 2 bit reset
    uint32_t GPIOA_BRR3:1; // GPIOA pin 3
    uint32_t GPIOA_BRR4:1; // GPIOA pin 4 bit reset
    uint32_t GPIOA_BRR5:1; // GPIOA pin 5
    uint32_t GPIOA_BRR6:1; // GPIOA pin 6 bit reset
    uint32_t GPIOA_BRR7:1; // GPIOA pin 7  
    uint32_t GPIOA_BRR8:1; // GPIOA pin 8 bit reset
    uint32_t GPIOA_BRR9:1; // GPIOA pin 9
    uint32_t GPIOA_BRR10:1; // GPIOA pin 10 bit reset
    uint32_t GPIOA_BRR11:1; // GPIOA pin 11
    uint32_t GPIOA_BRR12:1; // GPIOA pin 12 bit reset
    uint32_t GPIOA_BRR13:1; // GPIOA pin 13
    uint32_t GPIOA_BRR14:1; // GPIOA pin 14 bit reset
    uint32_t GPIOA_BRR15:1; // GPIOA pin 15 bit reset
}GPIOA_BRR_B_t;

typedef union
{
    GPIOA_BRR_B_t B;
    uint32_t U;
}GPIOA_BRR_Reg_t;

extern volatile GPIOA_BRR_Reg_t GPIOA_BRR_Reg;

typedef struct
{
    uint32_t GPIOB_BRR0:1; // GPIOB pin 0 bit reset
    uint32_t GPIOB_BRR1:1; // GPIOB pin 1
    uint32_t GPIOB_BRR2:1; // GPIOB pin 2 bit reset
    uint32_t GPIOB_BRR3:1; // GPIOB pin 3
    uint32_t GPIOB_BRR4:1; // GPIOB pin 4 bit reset
    uint32_t GPIOB_BRR5:1; // GPIOB pin 5
    uint32_t GPIOB_BRR6:1; // GPIOB pin 6 bit reset
    uint32_t GPIOB_BRR7:1; // GPIOB pin 7  
    uint32_t GPIOB_BRR8:1; // GPIOB pin 8 bit reset
    uint32_t GPIOB_BRR9:1; // GPIOB pin 9
    uint32_t GPIOB_BRR10:1; // GPIOB pin 10 bit reset
    uint32_t GPIOB_BRR11:1; // GPIOB pin 11
    uint32_t GPIOB_BRR12:1; // GPIOB pin 12 bit reset
    uint32_t GPIOB_BRR13:1; // GPIOB pin 13
    uint32_t GPIOB_BRR14:1; // GPIOB pin 14 bit reset
    uint32_t GPIOB_BRR15:1; // GPIOB pin 15 bit reset
}GPIOB_BRR_B_t;

typedef union
{
    GPIOB_BRR_B_t B;
    uint32_t U;
}GPIOB_BRR_Reg_t;

extern volatile GPIOB_BRR_Reg_t GPIOB_BRR_Reg;

typedef struct
{
    uint32_t GPIOC_BRR0:1; // GPIOC pin 0 bit reset
    uint32_t GPIOC_BRR1:1; // GPIOC pin 1
    uint32_t GPIOC_BRR2:1; // GPIOC pin 2 bit reset
    uint32_t GPIOC_BRR3:1; // GPIOC pin 3
    uint32_t GPIOC_BRR4:1; // GPIOC pin 4 bit reset
    uint32_t GPIOC_BRR5:1; // GPIOC pin 5
    uint32_t GPIOC_BRR6:1; // GPIOC pin 6 bit reset
    uint32_t GPIOC_BRR7:1; // GPIOC pin 7  
    uint32_t GPIOC_BRR8:1; // GPIOC pin 8 bit reset
    uint32_t GPIOC_BRR9:1; // GPIOC pin 9
    uint32_t GPIOC_BRR10:1; // GPIOC pin 10 bit reset
    uint32_t GPIOC_BRR11:1; // GPIOC pin 11
    uint32_t GPIOC_BRR12:1; // GPIOC pin 12 bit reset
    uint32_t GPIOC_BRR13:1; // GPIOC pin 13
    uint32_t GPIOC_BRR14:1; // GPIOC pin 14 bit reset
    uint32_t GPIOC_BRR15:1; // GPIOC pin 15 bit reset
}GPIOC_BRR_B_t;

typedef union
{
    GPIOC_BRR_B_t B;
    uint32_t U;
}GPIOC_BRR_Reg_t;

extern volatile GPIOC_BRR_Reg_t GPIOC_BRR_Reg;

typedef struct
{
    uint32_t GPIOD_BRR0:1; // GPIOD pin 0 bit reset
    uint32_t GPIOD_BRR1:1; // GPIOD pin 1
    uint32_t GPIOD_BRR2:1; // GPIOD pin 2 bit reset
    uint32_t GPIOD_BRR3:1; // GPIOD pin 3
    uint32_t GPIOD_BRR4:1; // GPIOD pin 4 bit reset
    uint32_t GPIOD_BRR5:1; // GPIOD pin 5
    uint32_t GPIOD_BRR6:1; // GPIOD pin 6 bit reset
    uint32_t GPIOD_BRR7:1; // GPIOD pin 7  
    uint32_t GPIOD_BRR8:1; // GPIOD pin 8 bit reset
    uint32_t GPIOD_BRR9:1; // GPIOD pin 9
    uint32_t GPIOD_BRR10:1; // GPIOD pin 10 bit reset
    uint32_t GPIOD_BRR11:1; // GPIOD pin 11
    uint32_t GPIOD_BRR12:1; // GPIOD pin 12 bit reset
    uint32_t GPIOD_BRR13:1; // GPIOD pin 13
    uint32_t GPIOD_BRR14:1; // GPIOD pin 14 bit reset
    uint32_t GPIOD_BRR15:1; // GPIOD pin 15 bit reset
}GPIOD_BRR_B_t;

typedef union
{
    GPIOD_BRR_B_t B;
    uint32_t U;
}GPIOD_BRR_Reg_t;

extern volatile GPIOD_BRR_Reg_t GPIOD_BRR_Reg;

typedef struct
{
    uint32_t GPIOE_BRR0:1; // GPIOE pin 0 bit reset
    uint32_t GPIOE_BRR1:1; // GPIOE pin 1
    uint32_t GPIOE_BRR2:1; // GPIOE pin 2 bit reset
    uint32_t GPIOE_BRR3:1; // GPIOE pin 3
    uint32_t GPIOE_BRR4:1; // GPIOE pin 4 bit reset
    uint32_t GPIOE_BRR5:1; // GPIOE pin 5
    uint32_t GPIOE_BRR6:1; // GPIOE pin 6 bit reset
    uint32_t GPIOE_BRR7:1; // GPIOE pin 7  
    uint32_t GPIOE_BRR8:1; // GPIOE pin 8 bit reset
    uint32_t GPIOE_BRR9:1; // GPIOE pin 9
    uint32_t GPIOE_BRR10:1; // GPIOE pin 10 bit reset
    uint32_t GPIOE_BRR11:1; // GPIOE pin 11
    uint32_t GPIOE_BRR12:1; // GPIOE pin 12 bit reset
    uint32_t GPIOE_BRR13:1; // GPIOE pin 13
    uint32_t GPIOE_BRR14:1; // GPIOE pin 14 bit reset
    uint32_t GPIOE_BRR15:1; // GPIOE pin 15 bit reset
}GPIOE_BRR_B_t;

typedef union
{
    GPIOE_BRR_B_t B;
    uint32_t U;
}GPIOE_BRR_Reg_t;

extern volatile GPIOE_BRR_Reg_t GPIOE_BRR_Reg;

typedef struct
{
    uint32_t GPIOH_BRR0:1; // GPIOH pin 0 bit reset
    uint32_t GPIOH_BRR1:1; // GPIOH pin 1
    uint32_t GPIOH_BRR2:1; // GPIOH pin 2 bit reset
    uint32_t GPIOH_BRR3:1; // GPIOH pin 3
    uint32_t GPIOH_BRR4:1; // GPIOH pin 4 bit reset
    uint32_t GPIOH_BRR5:1; // GPIOH pin 5
    uint32_t GPIOH_BRR6:1; // GPIOH pin 6 bit reset
    uint32_t GPIOH_BRR7:1; // GPIOH pin 7  
    uint32_t GPIOH_BRR8:1; // GPIOH pin 8 bit reset
    uint32_t GPIOH_BRR9:1; // GPIOH pin 9
    uint32_t GPIOH_BRR10:1; // GPIOH pin 10 bit reset
    uint32_t GPIOH_BRR11:1; // GPIOH pin 11
    uint32_t GPIOH_BRR12:1; // GPIOH pin 12 bit reset
    uint32_t GPIOH_BRR13:1; // GPIOH pin 13
    uint32_t GPIOH_BRR14:1; // GPIOH pin 14 bit reset
    uint32_t GPIOH_BRR15:1; // GPIOH pin 15 bit reset
}GPIOH_BRR_B_t;

typedef union
{
    GPIOH_BRR_B_t B;
    uint32_t U;
}GPIOH_BRR_Reg_t;

extern volatile GPIOH_BRR_Reg_t GPIOH_BRR_Reg;





#endif // STM32L433_LL_GPIO_CFG_H